export const aboutUsInformation = [
    {
        headline : "Робимо ваш автомобіль економічніше та екологічніше!",
        text : [
            "Ми – експерти з встановлення газобалонного обладнання на автомобілі, які мають понад 5 років досвіду у цій сфері. Ми гарантуємо швидку та якісну установку обладнання, з урахуванням усіх вимог та норм.",
            "Ми також допомагаємо нашим клієнтам у сертифікації обладнання, щоб гарантувати їхню безпеку та відповідність усім стандартам.",
            "Наша компанія прагне забезпечити максимальну зручність та комфорт нашим клієнтам, надаючи широкий спектр послуг із встановлення та обслуговування газобалонного обладнання.",
            "Звертайтесь до нас, і ми із задоволенням допоможемо вам заощаджувати на паливі та покращувати екологічні показники вашого автомобіля.",
        ],
        img : require("../Images/about_us.jpg")
    }
]

export const aboutUsAdvantages = [
  "Понад 5 років досвіду в установці газобалонного обладнання",
  "Якісне та швидке встановлення обладнання з урахуванням норм та вимог",
  "Допомога у сертифікації обладнання для гарантованої безпеки клієнтів",
  "Широкий спектр послуг з встановлення та обслуговування газобалонного обладнання.",
  "Збільшення економії на паливі та покращення екологічних показників автомобіля клієнта.",
  "Доступність та гнучкий графік роботи",
  "Кваліфіковані спеціалісти з великим досвідом роботи",
  "Гарантія на виконані роботи та встановлене обладнання",
  "Використання якісних запчастин та комплектуючих під час встановлення",
  "Наявність професійного обладнання та інструментів для роботи",
]

export const homeInfo = [
    {
        headline : "Вигоди ГБО від Monogas",
        text : [
            "ГБО від Monogas – ГБО від найкращої автогазової СТО",
            "Впевненість. Monogas – це професійний монтаж, гарантія якості та кваліфіковане обслуговування.",
            "Безпека. Жодних б/в балонів та обладнання. Ми не використовуємо нелегальне обладнання, підробки та копії.",
            "Якість. ГБО монтується відповідно до технологічних карт. Проведення та рукави укладаються в гофри.",
            "Економічність. Сучасне ГБО дозволяє суттєво знизити витрати на паливо та обслуговування автомобіля."        ],
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg")
    },
    {
        headline : "Етапи встановлення ГБО",
        text : [
            "1. Ви отримуєте докладну консультацію з підбором оптимальних комплектуючих для вашого автомобіля.",
            "2. Приганяєте автомобіль на СТО та після діагностики наші майстри встановлюють на нього ГБО.",
            "3. Монтаж газобалонного обладнання та його ретельне налаштування займають приблизно 1 робочий день.",
            "4. Ви забираєте переобладнаний автомобіль та весь пакет документів для перереєстрації."
        ],
        img : require("../Images/car_with_hood_up.avif")
    },
    {
        headline : "Monogas - це:",
        text : [
            "Досвідчені майстри ГБО. Ми вирішуємо будь-які завдання у сфері ГБО та гарантуємо кваліфіковане обслуговування вашого автомобіля.",
            "Обслуговуємо на 100%. Незалежно від того, де та яке ГБО ви встановили, наші майстри нададуть допомогу та підтримку з будь-яких питань у сфері ГБО.",
            "Сертифікація ГБО. Надаємо допомогу в одержанні сертифікації на газобалонне обладнання."

        ],
        img : require("../Images/cool_black_car_with_monogas.png")
    }
]

export const servicesName = [
    {
        title : "Установка ГБО 2-го покоління",
        path : "second_generation",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
            {
                headline : "Переваги використання газобалонної системи 2-го покоління",
                content : [
                    "Простота і надійність конструкції, мінімальну присутність електроніки, висока ремонтопридатність в звичайних умовах, доступна непрофесіоналові настройка і діагностика, недороге обладнання і вартість його монтажу.",
                    "Залежно від двигуна вашого автомобіля використовуються і різні покоління газобалонного обладнання. Класичне і досить поширене ГБО 2 покоління використовують для установки на карбюраторні двигуни, мотори з одною бензиновою форсункою чи інжекторним впорскуванням палива. Враховуючи ймовірність виникнення зворотних хлопків важливою технічною умовою установки ГБО 2 покоління є металевий впускний колектор. У автомобілів після 2001 року колектор може бути виконаний з пластика, а значить він потребує ГБО 4 покоління."
                ],
            },
            {
                headline : "Переваги ГБО 2 покоління",
                content : [
                    "Це найпростіша система впорскування газового палива. Вона невибаглива до установки, експлуатації і ремонту. Її монтаж не вимагає висококваліфікованого обслуговування; це переважно механічний пристрій, з мінімумом електронних вузлів і відсутністю складної програмної складової. Придбати ГБО 2 покоління можна в інтернет-магазині AutogasMarket."
                ]
            },
            {
                headline : "Конструкція і принцип дії",
                content : [
                    "У балоні, що традиційно встановлюється в кормовій частині автомобіля, пропан-бутан міститься в рідкій фазі під тиском до 16 атмосфер. Через мультиклапан газ під тиском подається в паливну (газову) магістраль, яка і підводить його в підкапотний простір. Тут на вході пропан-бутан спочатку потрапляє в електроклапан з вбудованим паливним фільтром, який уловлює і відокремлює з газу смоляні і тверді речовини."
                ],
                img : require("../Images/second_generation_page.jpg"),
            },
            {
                content : [
                    "При активації режиму їзди на газі, електроклапан відкривається, і рідкий пропан-бутан надходить у двоступеневий вакуумний або електронний редуктор-регулятор. Тут він переводиться з рідкої фази в парову, за рахунок підігріву редуктора від системи охолодження, а тиск газу знижується в першій камері до 2 атм. і далі в другій до 0,5 атм. Після цього під впливом розрідження утвореного всередині впускного колектора працюючого мотора, газ з другого ступеня редуктора всмоктується через змішувач і надходить у карбюратор або колектор (інжекторний варіант), після чого подається в циліндри."
                ],
            },
            {
                headline : "Вартість переходу на ГБО 2 покоління",
                content : [
                    "Завдяки компанії Profigas переобладнання вашого автомобіля буде економічно вигідним. Ми пропонуємо лояльні ціни не обладнання і його монтаж, а також сервісне і гарантійне обслуговування. Доступні наступні варіанти компоновки ГБО другого покоління:",
                    "Система живлення «Карбюратор» включає клапан бензину, редуктор, перемикач газ / бензин, змішувач і дозатор газу. Відповідно моделі автомобіля підбирається балон з мультиклапаном. Ціна – від 8000 грн.",
                    "Система живлення «Інжектор» – крім стандартного набору, в систему додається емулятор бензинових форсунок. Ціна для моноінжектора – від 8500 грн., Інжектора – від 9000 грн."
                ]
            },
        ]
    },
    {
        title : "Установка ГБО 4-го покоління",
        path : "fourth_generation",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
            {
                headline : "Що привнесли газобалонні системи 4-покоління",
                content : [
                    "Порівняно недавно газове обладнання 4 покоління набуло поширення. Воно набагато ефективніше, ніж попередні системи, так як дозволяє здійснювати управління роботою двигуна, орієнтуючись на показання датчиків. Варто зауважити, що використовується таке обладнання на автомобілях з інжекторною системою уприскування. ",
                    "По-перше, виникає необхідність у калібрування, яка проводиться за даними, отриманими зі штатних бензинових форсунок.",
                    "По-друге, в роботі бере участь безліч датчиків – витрати повітря, положення дросельної заслінки, детонації, швидкості та інші."
                ],
            },
            {
                headline : "Переваги ГБО 4 покоління",
                content : [
                    "Слід виділити відмітні особливості ГБО 4-го покоління, які характеризують позитивні якості, в порівнянні з попередніми системами:",
                    "При проведенні встановлення обладнання неможливо допустити помилки, робота проводиться досить просто за рахунок того, що всі з’єднання проводів мають виконання у вигляді різних роз’ємів, сплутати їх неможливо, тому ризик неправильного підключення виключено;",
                    "Витрата палива (газу) мінімальний за рахунок використання микроконтроллерной системи управління роботою обладнання;",
                    "Автомобіль, обладнаний ГБО 4-го покоління, відповідає нормам токсичності Євро-2, Євро-3 і Євро-4;"
                ]
            },
            {
                headline : "Основні вузли ГБО 4 покоління",
                content : [
                    "Для зберігання стисненого газу використовується балон. До нього пред’являються певні вимоги – герметичність, надійність, міцність. Для використання газового балона на автомобілі потрібен дозвіл. Видати його можуть тільки фахівці, у яких є ліцензія для здійснення даної процедури. Так як впорскування газу відбувається під тиском, меншим ніж те, яке в балоні, то необхідно його знижувати. Для цієї мети використовується редуктор. В метанових установках вони мають два ступені зниження тиску, а в пропан-бутанових достатньо однієї. Причина – у першому випадку тиск у балоні може досягати значення до 200 Атмосфер, у другому – до 16."
                ],
                img : require("../Images/fourth_generation_page.jpg"),
            },
            {
                content :[
                    "Газові форсунки необхідні для вприскування палива в камеру згоряння. Вони з’єднані з редуктором-випарником. Управління всією системою здійснюється за допомогою електронної начинки – ЕБУ, яка працює завдяки мікропроцесору. В нього закладається прошивка, яка забезпечує роботу згідно заздалегідь продуманим алгоритмом. Газове обладнання 4 покоління має перевагу перед більш ранніми – вибір палива відбувається автоматично, без участі водія. Для цього тільки й потрібно, що встановити перемикати газ-бензин в перше положення."
                ],
            },
            {
                headline : "Як працює ЕБУ?",
                content : [
                    "При роботі проводиться зчитування даних, які надходять від датчиків. Зокрема, проводиться аналіз сигналів, що йдуть від лямбда-зондів – один встановлений до катколлектора, другий – після. Один основний, а інший є коригуючих. Всі параметри, лічені з датчиків надходять на вхід мікропроцесора.",
                    "Але тут виникає невелика проблема – рівень сигналу в одних зчитувальних пристроїв великий, а в інших – занадто маленький. Для узгодження датчиків і портів введення мікроконтролера використовуються узгоджувальні пристрої.",
                ]
            },
        ]
    },
    {
        title :  "Установка ГБО на FSI, TSI, GDI",
        path : "fsi_tsi_gdi",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
            {
                headline : "Що ховається за цими літерами?",
                content : [
                    "FSI – Fuel Stratified Injection (дослівно – пошарове упорскування палива) – атмосферні бензинові двигуни з безпосереднім упорскуванням палива, що встановлюються на автомобілі концерну VAG. Історія цих двигунів почалася в 2000 році після того, як перший серійний зразок був встановлений на Volkswagen. А на сьогоднішній день мотори із шильдиком FSI встановлюються лише на VolksWagen Touareg 4 WD.",
                    "TSI (TFSI) – Turbo Stratified Injection (турбоване пошарове упорскування) – це, по суті, FSI мотор, оснащений турбіною. Тому детально розглядати його ми не будемо, зазначимо лише, що TSI від TSFI відрізняється лише тим, що перші встановлюються на автомобілі VolksWagen, а другі на Audi. Ось такий кумедний маркетинговий хід, спрямований на популяризацію автомобілів дорожчого бренду!",
                    "GDI – Gasoline Direct Injection (дослівно – пряме упорскування бензину) – інжекторна система подачі палива для бензинових двигунів внутрішнього згоряння з безпосереднім упорскуванням палива. Використовується у автомобілях марки Mitsubishi."
                ],
            },
            {
                headline : "Принципові відмінності та особливості систем FSI/TSI",
                content : [
                    "Головна відмінність двигунів з технологіями TSI та FSI від звичайних ДВЗ – те, що подача палива здійснюється безпосередньо в камеру згоряння двигуна.",
                    "Примітний і той факт, що паливна система цих автомобілів оснащена другим контуром високого тиску, який дозволяє здійснювати подачу бензину точніше, що суттєво позначається на потужності двигуна та мінімалізації витрат палива.",
                    "Залежно від навантаження на двигун тиск бензину в паливній системі може коливатися в межах 0,5-0,05 МПа. А це означає, що якісь вищі сили відповідають за ухвалення рішення, під яким тиском подавати паливо зараз. І ці найвищі сили – окремий електронний блок управління."
                ]
            },
            {
                headline : "Конструкція і принцип дії",
                content : [
                    "У балоні, що традиційно встановлюється в кормовій частині автомобіля, пропан-бутан міститься в рідкій фазі під тиском до 16 атмосфер. Через мультиклапан газ під тиском подається в паливну (газову) магістраль, яка і підводить його в підкапотний простір. Тут на вході пропан-бутан спочатку потрапляє в електроклапан з вбудованим паливним фільтром, який уловлює і відокремлює з газу смоляні і тверді речовини."
                ],
                img : require("../Images/fsi_page.jpg"),
            },
            {
                content : [
                    "При безпосередньому впорскуванні бензинова форсунка, що піддається дії високої температури дуже швидко закоксовується і вигоряє якщо через неї не подається паливо. Для вирішення даної проблеми застосовується технологія довпирскування мінімальної дози бензину через форсунки при роботі двигуна на газовому паливі."
                ],
            },
        ]
    },
    {
        title : "Установка ГБО на електромобілі",
        path : "electric_car",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
            {
                headline : "В Україні масово встановлюють ГБО в електромобілі",
                content : [
                    "Наразі в Україні стали масово встановлювати газобалонне обладнання на підтримані електроавтомобілі. Це робиться для того, щоб покращити та збільшити запас ходу та підвищити рівень комфорту.",
                ],
                img : require("../Images/electro_page.jpg")
            },
            {
                content : [
                    "Так Так! Саме такою установкою ГБО автовласники іменитих електромобілів вирішують проблему невеликого запасу ходу, але вони не повністю переоснащують авто під їзду на пропан-бутані, а застосовують газ для зменшення витрати електрики.",
                    "У цьому випадку газовою системою виступає не саме обладнання, а піч та підключений до неї газовий балон. За допомогою автономної пічки можна знизити або взагалі не витрачати енергію акумулятора на обігрів салону і таким чином збільшити запас ходу."
                ]
            },
            {
                headline : "Відомі представники",
                content : [
                    "Також серед користувачів газової печі є відомі е-мобілі, такі як Nissan Leaf та Renault Zoe – ціна подібної печі варіюється від 8 до 15 тис. грн. ",
                    "Все залежить від моделі та функціоналу обігрівача. Адже, на ринку цього товару є недорогі пристрої китайського виробництва та дорожчого – це австрійського та німецького виробництва.",
                    "Хоча, встановлюючи подібне обладнання на електромобіль, воно може окупитися, наприклад, при роботі \"в режимі таксі\". А якщо його встановити для себе, то подібне ГБО забезпечить комфортом і невеликою економією коштів.",
                ],
            },
        ]
    },
    {
        title : "Установка ГБО на дизель",
        path : "diesel",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
            {
                headline : "Переваги газодизельних систем",
                content : [
                    "Економія паливних витрат до 40%;",
                    "Щадний режим роботи паливної системи;",
                    "Покращення згоряння дизельного палива;",
                    "Постійно чистий фільтр сажі;",
                    "М'яка, плавна робота двигуна;",
                    "Приріст потужності до 15%;",
                    "Збільшення запасу ходу до 50%.",
                    "Зростання цін на дизельне паливо робить економічно виправданим оснащення автомобілів із дизельними двигунами газобалонним обладнанням. Установка ГБО разом із дизелем виправдана для вантажних машин, пасажирського транспорту та сільськогосподарської техніки. При схемі \"газ на дизель\" дизельне паливо використовується для запалювання паливо-повітряної суміші. Паралельна робота на обох видах палива дозволить заправляти солярку, якщо поблизу немає газозаправної станції.",
                ],
            },
            {
                headline : "Вигоди спільного використання газового обладнання та дизеля",
                content : [
                    "Окрім очевидної економічної вигоди від різниці цін, монтаж ГБО на дизель зменшує знос механізмів двигуна та викиди в атмосферу.",
                    "Паливо вигоряє значно більшою мірою, що зменшує накопичення гару на деталях двигуна та вміст шкідливих речовин у вихлопі.",
                    "Переробка паливної системи не вимагає радикальних змін конструкції та складних технічних хитрощів, при цьому не знижуючи, а підвищуючи ресурс механізмів та забезпечуючи цілу низку переваг.",
                ]
            },
            {
                headline : "ГБО для дизельного транспорту має наступний принцип роботи",
                content : [
                    "Установка на штатний паливний насос дозуючого пристрою (залишається можливість роботи також на дизельному паливі у звичайному режимі), яке набирає чинності при подачі на нього електрики;",
                    "Дозуючий пристрій обмежує подачу солярки та дозволяє оптимізувати її використання при різних навантаженнях;",
                    "Подача газу до впускного колектора в достатній пропорції з потраплянням безпосередньо в циліндри;",
                    "На останній стадії такту стиснення в циліндри подається запальна доза дизельного палива та здійснюється запалення газово-повітряної суміші.",
                    "Система налаштована таким чином, що на холостому ходу автомобіль працює тільки на дизелі, а при збільшенні обертів та підвищеному навантаженні здійснюється процес заміщення."
                ],
                img : require("../Images/diesel_page.jpg"),
            },
            {
                headline : "Серед мінусів використання ГБО слід зазначити",
                content : [
                    "Висока початкова вартість. Середня ціна складає близько 500 євро.",
                    "Зниження потужності проти бензином.",
                    "Необхідність переобладнання транспортного засобу.",
                    "Високі витрати обслуговування системи. Кожні 15 тис. км. необхідно змінювати фільтр. Планові перевірки відбуваються кожні 250 тис. км пробігу.",
                    "Зниження місткості багажника.",
                    "Необхідність реєстрації обладнання.",
                    "Проблеми з продажем авто із ГБО. Деякі покупці можуть бути противниками переобладнання та відмовляться брати машину.",
                ]
            },
        ]
    }    
]

export const novaPoshtaAdresses = [
    'Отделение №1: Киевское шоссе (ран. Ленинградское шоссе), 27',
    'Отделение №2: ул. Базовая, 16 (Промрынок, 7 км)',
    'Отделение №3: ул. Дальницкая, 23/4',
    'Отделение №4: ул. Академика Вильямса, 86',
    'Отделение №5 (до 30 кг на одно место): ул. Академика Филатова, 24',
    'Отделение №6 (до 30 кг на одно место): с. Латовка, ул. Кооперативная, 2а (Авторынок "Куяльник")',
    'Отделение №7 (до 30 кг): ул. Жуковского, 10',
    'Отделение №9 (до 30 кг): ул. Сегедская, 18',
    'Отделение №10 (до 30 кг): ул. Давида Ойстраха (ран. Затонского), 4',
    'Отделение №12 (до 30 кг): ул. Софиевская, 34',
    'Отделение №13 (до 30 кг): ул. Семена Палия (ран. Днепропетровская дорога), 82',
    'Отделение №14 (до 30 кг): ул. Маршала Малиновского, 71',
    'Отделение №15: Тираспольское шоссе, 15б',
    'Отделение №16 (до 30 кг на одно место): ул. Малиновского, 27а (маг. "Копейка")',
    'Отделение №17 (до 30 кг): ул. Разумовская, 29',
    'Отделение №18 (до 30 кг): ул. Фонтанская дорога, 16/8',
    'Отделение №19 (до 30 кг на одно место): ул. Радостная, 23',
    'Отделение №20 (до 30 кг на одно место): ул. Малая Арнаутская 119',
    'Отделение №21 (до 30 кг): просп. Александровский, 21',
    'Отделение №22 (до 30 кг на одно место): ул. Еврейская, 1',
    'Отделение №23 (до 30 кг): ул. Высоцкого, 23',
    'Отделение №24 (до 30 кг на одно место): ул. Фонтанская дорога, 4а',
    'Отделение №25 (до 15 кг), Мини-отделение: ул. Малая Арнаутская, 45',
    'Отделение №26 (до 30 кг на одно место): ул. Семена Палия (ран. Днепропетровская дорога), 126',
    'Отделение №27 (до 30 кг): ул. Новосельского, 64',
    'Отделение №28 (до 30 кг на одно место): ул. Академика Королева, 94',
    'Отделение №29 ( до 30 кг): ул. Говорова, 7А',
    'Отделение №30 (до 30 кг): ул. Успенская, 7',
    'Отделение №31(до 30 кг на одно место): ул. Героев обороны Одессы (ран. Героев Сталинграда), 52',
    'Отделение №32 (до 30 кг на одно место): ул. Фонтанская дорога, 58',
    'Отделение №33 (до 30 кг): ул. Романа Кармена, 15 (просп. Шевченка)',
    'Отделение №34: ул. 7 км Овидиопольской дороги, 1 (Эпицентр)',
    'Отделение №35 (до 30 кг на одно место): ул. Канатная, 83',
    'Отделение №36 (до 30 кг на одно место): ул. Ивана и Юрия Лип (ран. Гайдара), 5',
    'Отделение №37 (до 30 кг): ул. Александра Невского, 57',
    'Отделение №38 (до 15 кг), Мини-отделение: ул. Днепропетровская дорога, 127/3 (ТЦ "Волна")',
    'Отделение №39 (до 30 кг на одно место): ул. Одария, 2',
    'Отделение №42 (до 15 кг) Мини-отделение: ул. Новощепной ряд, 2 (ТЦ "Остров")',
    'Отделение №43 (до 5 кг), Мини-отделение: просп. Добровольского, 137а (ТЦ "Мой Дом")',
    'Отделение №44 (до 5 кг) Мини-отделение: проул. Симафорный, 4 (маг. "Фуршет")',
    'Отделение №45 (до 15 кг) Мини-отделение: просп. Адмиральский, 1В',
    'Отделение №46 (до 10 кг) Мини-отделение: ул. С. Палия (ран.Днепроп. дорога), 125б (маг."Фуршет")',
    'Отделение №47 (до 15 кг), Мини-отделение: ул. Екатериненская, 27/1',
    'Отделение №48 (до 30 кг): ул. Екатерининская, 85',
    'Отделение №49 (до 5 кг) Мини-отделение: просп. Добровольского, 71/1 (маг."Копейка")',
    'Отделение №50 (до 5 кг), Мини-отделение: просп. Добровольского, 70б (маг."Копейка")',
    'Отделение №51 (до 2 кг), Мини-отделение: просп. Небесной Сотни (ран. Марш. Жукова), 65а (Копейка)',
    'Отделение №52 (до 15 кг), Мини-отделение: ул. Раскидайловская, 18',
    'Отделение №53 (до 5 кг) Мини-отделение: просп. Добровольского, 130/5 (маг."Копейка")',
    'Отделение №54 (до 2 кг) Мини-отделение: просп. Академика Глушко, 11/1 (маг."Копейка")',
    'Отделение №55 (до 2 кг) Мини-отделение: просп. Шевченко, 4е (маг."Копейка")',
    'Отделение №56 (до 15 кг) Мини-отделение: ул. Генерала Бочарова, 50',
    'Отделение №58 (до 30 кг на одно место): ул. Академика Филатова, 62',
    'Отделение №59 ( до 30 кг на одно место): ул. Французский бульвар, 9',
    'Отделение №60 (до 30 кг на одно место): ул. Старопортофранковская, 103а',
    'Отделение №61 (до 30 кг на одо место): ул. Ицхака Рабина, 23',
    'Отделение №62 (до 5 кг), Мини-отделение: ул. Люстдорфская дорога, 170',
    'Отделение №63 (до 30 кг на одно место): Фонтанская дорога, 14а',
    'Отделение №64 (до 30 кг на одо место): ул. Генерала Бочарова, 37',
    'Отделение №65 (до 2 кг) Мини-отделение: ул. Степовая, 28 (маг."Обжора")',
    'Отделение №66 (до 5 кг), Мини-отделение: ул. Академика Королева, 19',
    'Отделение №67 (до 30 кг): ул. Марсельская, 35 б',
    'Отделение №69 (до 5 кг) Мини-отделение: ул. Черняховского, 4 (ТЦ "5 элемент")',
    'Отделение №70 (до 15 кг) Мини-отделение: просп. Небесной Сотни (ран.М.Жукова), 3а, кв.6 (ТЦ Успех)',
    'Отделение №71(до 30 кг на одо место): ул. Варненская, 15',
    'Отделение №72 (до 30 кг на одно место): ул. Балковская, 30',
    'Отделение №73 (до 30 кг на одно место): ул. Ильфа и Петрова, 63/1',
    'Отделение №74 (до 30 кг на одно место): ул. Ильфа и Петрова, 35а',
    'Отделение №75 (до 30 кг на одно место): просп. Небесной Сотни (ран. Маршала Жукова), 23',
    'Отделение №77 (до 30 кг) Мини-отделение: Новониколаевская дорога, 1 (маг." Таврия В")',
    'Отделение №78 (до 5 кг), Мини-отделение: ул. Мельницкая, 20',
    'Отделение №79  (до 5 кг) Мини-отделение: ул. Пушкинская, 72 (маг."ЦУМ")',
    'Отделение №80 (до 15 кг) Мини-отделение: просп. Небесной Сотни (ран. М. Жукова), 101м (маг."МЕТРО")',
    'Отделение №81 (до 5 кг) Мини-отделение: ул. Аэропортовская, 29 (маг."МЕТРО")',
    'Отделение №82 (до 30 кг на одно место): пл. Старосенная, 15',
    'Отделение №83 (до 15 кг), Мини-отделение: ул. Филатова Академика, 2',
    'Отделение №84 (до 5 кг), Мини-отделение: ул. Люстдорфская дорога, 55 (ТЦ "Альтаировский")',
    'Отделение №85 (до 30 кг на одно место): просп. Адмиральский, 37',
    'Отделение №86 (до 15 кг), Мини-отделение: ул. Генуэзская, 24Б (ТОЦ "KADORR City Mall)',
    'Отделения №87 (до 30 кг): ул. Академика Королёва, 79',
    'Отделение №88 (до 30 кг): просп. Добровольского, 83',
    'Отделение №89 (до 30 кг): ул. Семена Палия (ран. Днепропетровская дорога), 68',
    'Отделение №90 (до 30 кг на одно место): ул. Люстдорфская дорога, 90г',
    'Отделение №91 (до 5 кг), Мини-отделение: просп. Академика Глушко, 22',
    'Отделение №92 (до 15 кг) Мини-отделение: ул. Николаевская дорога, 307/1 (маг."МЕТРО")',
    'Отделение №93 (до 2 кг), Мини-отделение: ул. Академика Вильямса, 9а',
    'Отделение №94 (до 30 кг на одно место): ул. Екатериненская, д. 84/86, пом. 501',
    'Отделение №95 (до 10 кг) Мини-отделение: площадь Греческая, 3/4',
    'Отделение №96 (до 5 кг) Мини-отделение: ул. Ильфа и Петрова, 39 (маг."Копейка")',
    'Отделение №99 (до 10 кг) Мини-отделение: площадь Греческая, 1',
    'Отделение № 100 (до 15 кг), Мини-отделение: ул. Маршала Малиновского, 33 (маг. "Сильпо")',
    'Отделение №101 (до 30 кг): с. Лиманка, "Радужный" массив ж/массива "Ульяновка", 23, пом. 7',
    'Отделение №102 (до 30 кг): пгт. Авангард, ул. Европейская, 9, секция 1, пом. 1В',
    'Отделение №103 (до 5 кг), Мини-отделение: ул. Массив Радужный, 16/4',
    'Отделение №104 (до 5 кг) Мини-отделение: пл. Независимости, 1 (ТЦ "Панорама")',
    'Отделение №105 (до 15 кг), Мини-отделение: ул. Средньофонтанская, 19г (ТЦ "Кристал")',
    'Отделение №106 (до 30 кг на одно место): ул. Семена Палия, 103б',
    'Отделение №107 (до 15 кг) Мини-отделение: Польский спуск, 11',
    'Отделение №108 (до 5 кг), Мини-отделение: бульв. Десантный, 16 (маг."Точка")',
    'Отделение №110 (до 10 кг), Мини-отделение: ул. Инглези (ран. 25-й Чапаевской див), 10 (Обжора)',
    'Отделение №112 (до 2 кг), Мини-отделение: ул. Старопортофранковская, 22/1',
    'Отделение №113 (до 2 кг), Мини-отделение: ул. Академика Вильямса, 46/1 (АЗС "SunOil")',
    'Отделение №117 (до 15кг), Мини-отделение: ул. Ивана и Юрия Лип (ран. Гайдара), 34',
    'Отделение №118 (до 30 кг): просп. Шевченко, 27',
    'Отделение №119 (до 30 кг): ул. Дюковская, 14',
    'Отделение №120 (до 15 кг), Мини-отделение: ул. Инглези (ран. 25-й Чапаев.див), 13А (АЗС Sun Oil)',
    'Отделение №121 (до 5 кг), Мини-отделение: ул. Академика Заболотного, 24',
    'Отделение №122 (до 30 кг на одно место): ул. Столбовая, 28',
    'Отделение №124 (до 15 кг), Мини-отделение: ул. Проездная, 12',
    'Отделение №125 (до 30 кг на одо место): ул. Генерала Петрова, 1',
    'Отделение №126: ул. Грушевского, 41',
    'Отделение №127 (до 30 кг): ул. Колонтаевская, 58 (Автовокзал)',
    'Отделение №128  (до 30 кг на одно место): просп. Ак. Глушко, 29',
    'Отделение №129 (до 30 кг): переул. Маланова, 6',
    'Отделение №130 (до 30 кг на одно место): ул. Центральный аэропорт, 25',
    'Отделение №131: ул. Генерала Бочарова 50/1 (Рынок Початок)',
    'Почтомат "Новая Пошта" №3086, ул. Дальницькая, 23/4 (Отделение  3)',
    'Почтомат "Новая Пошта" № 3233: ул. Академика Филатова, 24 (Отделение №5)',
    'Почтомат "Новая Почта" №3234: ул. Академика Филатова, 62 (Отделение №58)',
    'Почтомат "Новая Пошта" №3238: ул. Базовая, 16 (Отделение №2)',
    'Почтомат "Новая Пошта" №3239: ул. Базовая, 16 (Отделение №2)',
    'Почтомат  "Новая Пошта" №3243: Тираспольское шоссе, 15б (Отделение №15)',
    'Почтомат "Новая Пошта" №3244: Тираспольское шоссе, 15б (Отделение №15)',
    'Почтомат "Новая Пошта" №3250: ул. Академика Вильямса, 86 (Отделение №4)',
    'Почтомат " Новая Пошта" №3251: ул. Академика Вильямса, 86 (Отделение №4)',
    'Почтомат " Новая Пошта" №3259: ул. 7 км Овидиопольской дороги, 1 (Епицентр) (Отделение №34)',
    'Почтомат "Новая Пошта" №3260: ул. 7 км Овидиопольской дороги, 1 (Епицентр) (Отделение №34)',
    'Почтомат "Новая Пошта" №3262: ул. Генерала Бочарова, 37 (Отделение №64)',
    'Почтомат "Новая Пошта" № 3265: ул. Генерала Бочарова, 50/1 (Отделение №131)',
    'Почтомат "Новая Пошта" №3266: ул. Генерала Бочарова, 50/1 (Отделение №131)',
]

export const ourProjectsHedlines = [
    {
        headline : "Всі роботи",
    },
    {
        headline : "Монтаж",
    },
    {
        headline : "Сервіс",
    }
]

export const works = [
    {
        model : "Chevrolet Volt 1.4L (HYBRID) 2012",
        type : "Монтаж",
        img : require("../Images/volt_1.jpg"),
        cost : "900$",
        subImage : [
            require("../Images/volt_1.jpg"),
            require("../Images/volt_2.jpg"),
            require("../Images/volt_3.jpg"),
            require("../Images/volt_4.jpg"),
        ],
        avtoInfo : [
            "Chevrolet",
            "Volt",
            "2012",
            "1.4L (Гібрид)",
            "Автомат",
            "90.000 км",
            "Передній привід",
        ],
        text : [
            "ГБО на Chevrolet Volt - екологічне паливо Поки ціни на бензин продовжують збільшуватися, більш практичні автомобілісти оперативно переходять на газобалонне обладнання. Chevrolet Volt - одна з кращих моделей в лінійці марки і багато її власники переобладнають свої автомобілі на газ.",
            "Придбати і встановити ГБО Ви можете в нас, компанії «Monogas». Перехід на газобалонне обладнання - практичне рішення для власників Chevrolet Volt.",
            "Балон з газом в Шевроле монтується також, як і в багатьох інших авто: в багажнику, на місці «запаски». Вибрати газ на Chevrolet Volt в компанії «Monogas» - означає придбати якісний пристрій за привабливою вартістю.",
        ]
    },
    {
        model : "Audi Q7 2006",
        type : "Сервіс",
        img : require("../Images/audi_1.jpg"),
        cost : "650грн",
        subImage : [
            require("../Images/audi_1.jpg"),
            require("../Images/audi_2.jpg"),
            require("../Images/audi_3.jpg"),
            require("../Images/audi_4.jpg"),
        ],
        avtoInfo : [
            "Audi",
            "Q7",
            "2006",
            "3L (Дизель)",
            "Автомат",
            "209.000 км",
            "Повний привід",
        ],
        text : [
            "Газ на Audi - просто і надійно Німецькі автомобілі Audi дуже популярні і цим пояснюється їх велика кількість серед машин, переобладнаних компанією «Monogas».",
            "Багато установників відмовляються ставити ГБО на Audi тільки з остраху, що преміальний бренд виявиться їм не по зубах і лише професіонали компанії «Monogas» готові переобладнати Audi. A4, A6, A8, моделі Quattro або кроссовери Q-серії вміють економити паливо і можуть бути переобладнані на газ.",
            "Переобладнання Audi на газ завдання не найпростіше, але ми допоможемо Вам вибрати газобалонне обладнання, встановимо його на автомобіль і надамо весь спектр супутніх послуг.",
        ]
    },
    {
        model : "BMW X5 2003",
        type : "Монтаж",
        img : require("../Images/bmw_1.jpg"),
        cost : "500$",
        subImage : [
            require("../Images/bmw_1.jpg"),
            require("../Images/bmw_2.jpg"),
            require("../Images/bmw_3.jpg"),
            require("../Images/bmw_4.jpg"),
        ],
        avtoInfo : [
            "BMW",
            "X5",
            "2003",
            "3L (Бензин)",
            "Автомат",
            "320.000 км",
            "Повний привід",
        ],
        text : [
            "Переобладнання BMW – газ на преміум Автомобілі BMW запросто можуть бути переобладнані на газ. Деякі моделі цього виробника навіть у заводському виконанні мають поширене в Європі метанове ГБО. ",
            "Мотори BMW добре переносять переобладнання на газ і легко налаштовуються на оптимальну роботу. Компанія «Monogas» пропонує грамотну установку газу на BMW, що не тільки не зашкодить, але і піде на користь, тому що газ не містить домішок і присадок на відміну від бензину.",
            " При установці газу на BMW непогано себе зарекомендували люкс-комплектації ГБО. З надійним обладнанням від компанії «Monogas» у вас не виникне жодних проблем.",
        ]
    },
    {
        model : "Citroen C-Crosser 2008",
        type : "Сервіс",
        img : require("../Images/citroen_1.jpg"),
        cost : "350грн",
        subImage : [
            require("../Images/citroen_1.jpg"),
            require("../Images/citroen_2.jpg"),
            require("../Images/citroen_3.jpg"),
            require("../Images/citroen_4.jpg"),
        ],
        avtoInfo : [
            "Citroen",
            "C-Crosser",
            "2008",
            "2.4L (Дизель)",
            "Механіка",
            "208.000 км",
            "Повний привід",
        ],
        text : [
            "ГБО на Citroen: вирішення питання Французькі автомобілі користуються у нас величезною популярністю. Їх експлуатація не вимагає великих витрат але витрати на паливо однозначно можна зменшити за допомогою установки ГБО на Citroen.",
            "Переобладнання на газ дозволяє зробити Citroen екологічніше і при цьому заощадити гроші на паливі. На ці Citroen крім основних елементів ГБО найчастіше встановлюють емулятор рівня палива, і навіть варіатор кута випередження запалювання.",
            "При правильному налаштуванні ГБО на Citroen газова система функціонує не гірше штатної бензинової. Так що переобладнання Citroen на газ цілком виправдане рішення.",
        ]
    }
]

export const servicesInfoInstallation = [
    {
        headline : "Установка ГБО 2-го покоління",
        text : [
            "Вартість встановлення: від 260$",
            "Встановлюється інжекторні двигуни.",
            "Газ під власним тиском виходить по видатковій магістралі з балона до редуктора, там тиск знижується до робочого, і газ перетворюється з рідкого в газоподібний стан, нагріваючись при цьому."
        ],
        img : require("../Images/second_generation.jpg"),
        path : "second_generation"
    },
    {
        headline : "Установка ГБО 4-го покоління",
        text : [
            "Вартість встановлення:",
            "4 циліндри - від 390$",
            "6 циліндри - від 700$",
            "8 циліндри - від 900$",
            "ГБО 4 покоління – використовує систему циклічної подачі газу.",
            "За рахунок фазованого упорскування з'явилася можливість зменшити витрату палива, значно знизити кількість викидів у навколишнє середовище, знизити навантаження на випускні клапани та циліндро-поршневу систему, а також підвищити динамічні характеристики."
        ],
        img : require("../Images/fouth_generation.webp"),
        path : "fourth_generation"
    },
    {
        headline : "Установка ГБО на FSI, TSI, GDI",
        text : [
            "Вартість встановлення:",
            "4 циліндри - від 1000$",
            "6 циліндри - від 1200$",
            "8 циліндри - від 1400$",
            "ГБО на двигун TSI, GDI, TSI повинен гармонійно вписуватися в решту електроніки вашого автомобіля.",
            "«Рідна» прошивка, а також прошивка ГБО мають працювати злагоджено та не конфліктувати. Існують також універсальні варіанти, що підходять під будь-яку прошивку."
        ],
        img : require("../Images/tsi_fsi_tfsi.jpg"),
        path : "fsi_tsi_gdi"
    },
    {
        headline : "Установка ГБО на електромобілі",
        text : [
            "Вартість встановлення: від 500$",
            "У цьому випадку газовою системою виступає не саме обладнання, а піч та підключений до неї газовий балон.",
            "За допомогою автономної пічки можна знизити або взагалі не витрачати енергію акумулятора на обігрів салону і таким чином збільшити запас ходу."
        ],
        img : require("../Images/electro_car.jpg"),
        path : "electric_car"
    },
    {
        headline : "Установка ГБО на дизель",
        text : [
            "Вартість встановлення:",
            "4 циліндри - від 1350$",
            "6 циліндри - від 1470$",
            "Ступінь заміщення дизеля газом залежить від конструкції газобалонного обладнання та двигуна автомобіля. Має значення та навантаження на двигун.",
            "При досягненні співвідношення обох видів пального 80:20 пропадає характерний дизельних моторів вихлоп чорного диму. Дана схема - одна з небагатьох на ринку, що оптимізує роботу двигуна відразу за всіма параметрами."
        ],
        img : require("../Images/disel.png"),
        path : "diesel"
    }
]

export const tableText = [
    {
        title : "Перевірка герметичності системи",
        time :  "20-45 хв",
        cost : "160-360"
    },
    {
        title : "ТО-1-10 ГБО 4-го покоління (4, 6, 8 циліндри)",
        time : "1 год – 1 год 10 хв",
        cost : "480-650"
    },
    {
        title : "Проведення технічного обслуговування ГБО (4, 6, 8 циліндрів)",
        time : "70-95 хв",
        cost : "530-775"
    },
    {
        title : "Діагностика автомобіля",
        time : "14 хв",
        cost : "115"
    },
    {
        title : "Комп’ютерна діагностика",
        time : "38 хв",
        cost : "280"
    },
    {
        title : "Перевірка системи запалювання",
        time : "30 хв – 1 год",
        cost : "240-480"
    },
    {
        title : "Регулювання ГБО 2-го покоління",
        time : "30 хв",
        cost : "240"
    },
    {
        title : "Регулювання ГБО 2-го покоління на газоаналізаторі",
        time : "35 хв",
        cost : "285"
    },
    {
        title : "Комп’ютерне регулювання системи впорскування в русі з відстеженням паливних корекцій по OBDII",
        time : "56 хв",
        cost : "450"
    },
    {
        title : "Демонтаж/монтаж редуктора",
        time : "40 хв",
        cost : "320"
    },
    {
        title : "Заміна газового трубопроводу",
        time : "1-3 год",
        cost : "480-1440"
    },
    {
        title : "Капітальний ремонт редуктора: (розбирання, промивка, притирання клапанів, заміна ремкомплекту, збирання, перевірка на стенді, тарирування)",
        time : "1 год 20 хв",
        cost : "645"
    },
    {
        title : "Демонтаж/монтаж форсуночної рейки (групи форсунок)",
        time : "30 хв",
        cost : "240"
    },
    {
        title : "Промивка газової форсунки на стенді (1 шт)",
        time :  "15 хв",
        cost : "140"
    },
    {
        title : "Тарирування форсунки (1 шт)",
        time : "10 хв",
        cost : "85"
    },
    {
        title : "Демонтаж/монтаж балона",
        time : "30 хв – 2 год",
        cost : "240-960"
    },
    {
        title : "Демонтаж /монтаж мультиклапана",
        time : "30 хв – 2 год",
        cost : "240-960"
    },
    {
        title : "Заміна газової магістралі",
        time : "1 – 3 год",
        cost : "480-1440"
    },
    {
        title : "Перевірка герметичності системи впускного тракту за допомогою димогенератора",
        time : "30-60 хв",
        cost : "240-480"
    },
    {
        title : "Усунення витоку газу",
        time : "10-30 хв",
        cost : "80-240"
    },
    {
        title : "Заміна рукава (бензинового, газового, вакуумного)",
        time : "8 хв",
        cost : "70"
    },
    {
        title : "Заміна рукава системи охолодження",
        time : "20 хв",
        cost : "165"
    },
    {
        title : "Заміна фільтра рідкої фази в редукторі",
        time : "20 хв",
        cost : "165"
    },
    {
        title : "Заміна фільтра рідкої фази в клапані газу",
        time : "10 хв",
        cost : "165"
    },
    {
        title : "Заміна фільтра парової фази",
        time : "20 хв",
        cost : "85"
    },
    {
        title : "Заміна свічки запалювання (1 шт.)",
        time : "10 хв",
        cost : "85"
    }

]

export const shopFilter = [
    {
        headline : "Бренд",
        arrow : true
    },
    {
        headline : "Новий - б/в ",
        arrow : true,
        items : [
            "Новий",
            "Б/в"
        ]
    },
    {
        headline : "Статус товару",
        arrow : true,
        items : [
            "Є в наявності",
            "Нема в наявності"
        ]
    }
]

export const operators = [
    "93",
    "97",
    "98",
    "63",
    "39",
    "50",
    "66",
    "67",
    "68",
    "91",
    "92",
    "94",
    "95",
    "96",
    "99",
]

export const shopItems = [
    {
        img : [
            require("../Images/ShopItemImages/remcomplect_tomas/1.jpg"),
            require("../Images/ShopItemImages/remcomplect_tomas/2.webp"),
            require("../Images/ShopItemImages/remcomplect_tomas/3.webp"),
            require("../Images/ShopItemImages/remcomplect_tomas/4.webp"),
        ],
        headline : "Ремкомплект редуктора Tomasetto AT-07 повний",
        price : 391,
        brand : "Tomasetto",
        condition : "Новий",
        amount : 1,
        description: [
            "Ремкомплект для редуктора Tomasetto пропан-набір від італійського виробника, служить для заміни практично всіх деталей, що зношуються газового редуктора. Ремкомплект для редуктора Томасетто пропан виготовляють на сучасному обладнанні із застосуванням новітніх технологій. При виробництві застосовують високоякісні матеріали, що дозволяє набувати мембранам додаткових покращених характеристик.",
            "Переваги: дуже низька проникність газу, висока чутливість, стійкість до бензину та олії, додано фільтр та кришку фільтра, підвищений ресурс.",
            "Ремонтний комплект Tomasetto - оригінальний, виготовлений в Італії. Включає в себе мембрани газові 1-го і 2-го ступеня, тосольна мембрана, а також кільця ущільнювачів. З недавнього часу виробник додав до нього фільтр грубої очистки, кришку фільтра та 3 болти під шестигранний ключ для закріплення кришки фільтра. У комплект пружина 2-го ступеня не входить.",
            "Ремкомплект Томасетто підходить для редукторів серії АТ та АТ-07 Це редуктора 1. 2. 3 покоління ГБО без фільтра та з фільтром відповідно.",
            "Серед них моделі: RGTA3500, RGTA3510, RGTA3520, RGTA3000, RGTA3100, RGTA3200.",
            "Країна-виробник товару: Італія"
        ]
    },
    {
        img : [
            require("../Images/ShopItemImages/forsunka_hana/1.webp"),
        ],
        headline : "Форсунка Hana 2001 Rail, Type B",
        price : 575,
        brand : "Hana",
        condition : "Новий",
        amount : 0,
        description: [
            "Hana 2001 Rail – продукт корейської компанії Hana Engineering, який вигідно відрізняється серед конкурентів високою якістю, швидкодією, низькою шумністю та оптимальною ціною. Форсунки Hana 2001 Rail зберігають свої робочі характеристики протягом тривалого терміну експлуатації і добре зарекомендували себе при роботі в наших умовах за рахунок високої стійкості до забруднення.",
            "Hana 2001 Rail – форсунка для впорскування автогазових систем 4 покоління, яка здійснює дозовану подачу газу у впускний колектор. Форсунки Hana 2001 Rail можуть використовуватися як у пропан-бутановому, так і метановому ГБО.",
            "Форсунка Hana 2001 Rail, Type B (червоні, 26-39 Нр) призначена для збирання у форсуночні рейки за допомогою спеціальних монтажних наборів. Ця модель розрахована на роботу в системах потужністю 26-39 к.с. на циліндр.",
            "Країна-виробник товару: Південна Корея"
        ]
    },
    {
        img : [
            require("../Images/ShopItemImages/reductor_tomas/1.webp")
        ],
        headline : "Редуктор Tomasetto AT09 Nordic",
        price : 1372,
        brand : "Tomasetto",
        condition : "Б/в",
        amount : 5,
        description: [
            "Редуктор GreenGas AT09 Nordic призначений для установки ГБО 4 покоління на інжекторні двигуни і може забезпечувати стабільний тиск в системах до 170 л. с. Даний редуктор має вбудований фільтр грубого очищення, а також електроклапан підвищує безпеку системи. GreenGas AT09 Nordic – популярний редуктор від світового лідера в сфері ГБО італійської компанії Tomasetto. Ця модель проста в установці, налаштуванні і обслуговуванні, а в комплекті поставки є повний монтажний набір.",
            "Країна-виробник товару: Італія"
        ]
    },
    {
        img : [
            require("../Images/ShopItemImages/datchik_stag/1.webp"),
            require("../Images/ShopItemImages/datchik_stag/2.webp"),
            require("../Images/ShopItemImages/datchik_stag/3.webp"),
            require("../Images/ShopItemImages/datchik_stag/4.webp"),
            require("../Images/ShopItemImages/datchik_stag/5.webp"),
        ],
        headline : "Датчик тиску Stag PS-04 plus",
        price : 298,
        brand : "Stag",
        condition : "Новий",
        amount : 1,
        description: [
            "Даний датчик призначений для вимірювання: тиску газу, вакууму, розрідження та температури газу.",
            "Сумісний з усіма системами: Stag (GoFast, ECO, 4+, Qbox, Qnext і т.д.), Digitronic (Maxi2, Maxi2Titan, 6,8 cyl на базі AC), LPGTECH (DUO, ONE, 204, 104, 306, 308, Symbo), Yota (RED, Blue, Falcon), Europegas та багатьма іншими",
            "Має роз'єм підключення 5-pin, газовий вхід/вихід 12мм, вакуумний вхід/вихід 5мм",
            "В комплекті: Газовий трійник на 12мм, Кріпильна скоба, Вакуумний трійник на 5мм",
            "Країна-виробник товару: Польща"
        ]
    },
    {
        img : [
            require("../Images/ShopItemImages/datchik_davleniya_zenit/1.webp"),
            require("../Images/ShopItemImages/datchik_davleniya_zenit/2.webp"),
            require("../Images/ShopItemImages/datchik_davleniya_zenit/3.webp"),
            require("../Images/ShopItemImages/datchik_davleniya_zenit/4.webp")
        ],
        headline : "Датчик тиску та вакууму MAP Sensor Zenit",
        price : 1210,
        brand : "Zenit",
        condition : "Б/в",
        amount : 1,
        description: [
            "До вашої уваги пропонується датчик тиску та вакууму Zenit AA 612, сфера застосування якого інжекторна система розподіленого упорскування ГБО 4 покоління Zenit, Autronik, Torelli. Датчик ГБО Zenit AA 612 служить для вимірювання показань: вимірювання тиску газу у летючій фазі, на відрізку від газового редуктора до газових форсунок, вимірювання показань вакууму у впускному колекторі ДВЗ автомобіля.",
            "Після цього зібрані дані з обробленими показниками передаються в газовий блок управління (ЕБУ). Ці дані необхідні для правильної та коректної роботи інжекторної системи.",
            "Існує два типи 4-х контактних тупикових MAP Sensor Zenit AA 612: 5 Вт та 12 Вт. Це значення вибирається при підключенні діагностичним інтерфейсом до інжекторної системи. В наявності завжди обидва варіанти датчика тиску та вакууму Zenit AA 612, просто вкажіть у коментарях який саме мап сенсор Зеніт 4 піни застосовано у вашій системі.",
            "Країна-виробник товару: Італія"
        ]
    },
    {
        img : [
            require("../Images/ShopItemImages/zaslonka_master/1.webp")
        ],
        headline : "Дросельна заслінка Parts Master",
        price : 3399,
        brand : "Parts Master",
        condition : "Новий",
        amount : 1,
        description: [
            "Дросельна заслінка Parts Master 4891735AC CHRYSLER\\DODGE\\JEEP",
            "Підходить для авто: CHRYSLER 200 2011-2014, CHRYSLER SEBRING 2007-2008, DODGE AVENGER 2008-2014, DODGE CALIBER 2007-2012, DODGE JOURNEY 2009-2016, JEEP COMPASS 2010-2016, JEEP PATRIOT 2007-2016, JEEP RENEGADE 2016",
            "Країна-виробник товару: Китай"
        ]
    },
    {
        img : [
            require("../Images/ShopItemImages/datchik_PS-02_Plus/1.webp"),
            require("../Images/ShopItemImages/datchik_PS-02_Plus/2.webp"),
            require("../Images/ShopItemImages/datchik_PS-02_Plus/3.webp"),
            require("../Images/ShopItemImages/datchik_PS-02_Plus/4.webp"),
            require("../Images/ShopItemImages/datchik_PS-02_Plus/5.webp")
        ],
        headline : "Датчик тиску розрядження і температури газу PS-02 Plus",
        price : 390,
        brand : "Stag",
        condition : "Новий",
        amount : 2,
        description: [
            "Датчик PS-02 Plus (або мап-сенсор) використовується для вимірювання тиску газу, вакуумметричного тиску і температури газу в системах ГБО 4-го покоління. Дана модель датчика використовується в системах ГБО 4-го покоління, що працюють на базі електроніки STAG, Digitronic, Atiker, YOTA, LpgTech, а так само інших системах з аналоговою передачею даних.",
            "Датчик тиску газу є видатковими комплектуючих і час від часу доводиться міняти, оскільки через нього проходять кубометри газу, що містять у собі різноманітні домішки, які осідають на поверхні мікросхеми і руйнують її цілісність.",
            "У середньому мап-сенсор служить від 2-х до 7 років в залежності від періодичності заміни газових фільтрів, якості газового палива, місця і способу установки, а також параметрів систем ГБО.",
            "Країна-виробник товару: Польща"
        ]
    },
    {
        img : [
            require("../Images/ShopItemImages/datchik_AEB/1.webp"),
            require("../Images/ShopItemImages/datchik_AEB/2.webp")
        ],
        headline : "Датчик тиску газу AEB025 для систем ГБО AEB",
        price : 700,
        brand : "AEB",
        condition : "Новий",
        amount : 3,
        description: [
            "Датчик тиску та розрідження газу AEB025: 4-pin роз'єм, висока точність вимірювань та надійність, міцний композитний корпус",
            "Даний датчик сумісний з електронікою таких брендів: AEB, Reagas, Digitronic, Pride, King, Zavoli, Elpigas, Atiker",
            "Країна-виробник товару: Польща"
        ]
    },
    {
        img : [
            require("../Images/ShopItemImages/variator_green_gas/1.webp")
        ],
        headline : "Варіатор універсальний GreenGas UNI",
        price : 1558,
        brand : "GreenGas",
        condition : "Б/в",
        amount : 10,
        description: [
            "Варіатор кута випередження запалювання GREENGAS UNI по-справжньому унікальний і універсальний продукт. На відміну від аналогічних пристроїв інших виробників GREENGAS UNI є універсальним, адже він не прив'язаний до жодного кар-листу і має універсальну прошивку, що дозволяє встановлювати його на абсолютно будь-який автомобіль. Варіатор УОЗ GREENGAS UNI може працювати як з індукційним, так і з цифровим датчиком положення колінчастого валу. І в той же час один пристрій підтримує 1 індуктивний і 2 цифрових датчика одночасно, з можливістю різних конфігурацій їх підключення.",
            "Країна-виробник товару: Італія"
        ]
    },
    {
        img : [
            require("../Images/ShopItemImages/electronika_stag/1.webp"),
            require("../Images/ShopItemImages/electronika_stag/2.webp")
        ],
        headline : "Електроніка ГБО Stag-300 QMAX 6 Basic (6 цил)",
        price : 6363,
        brand : "Stag",
        condition : "Новий",
        amount : 4,
        description: [
            "Контролери нового покоління Stag 300 QMAX Basic відносяться до інноваційних розробок всесвітньо відомої компанії AC Spolka Akcyjna. Фірма-виробник зробила оновлення модельного ряду і вивела на ринок ряд функціональних і продуктивних пристроїв, до яких відноситься і контролер лінійки Q-покоління Stag 300 QMAX Basic.",
            "Особливості контролера Stag 300 6-QMAX Basic:",
            "* Модель розроблена спеціально для»automotive\". Встановлюється на авто з шестициліндровими двигунами з розподіленим уприскуванням бензину для отримання більш динамічного і економічного руху.",
            "* Попередня лінійка блоків управління, на базі якої і був розроблений даний контролер, - ISA2 відрізнялася використанням 16-бітного процесора. Завдяки вдосконаленій системі, задіяній в Q-поколінні, процесор став на порядок продуктивніше-32-бітний. Схемотехніка даного контролера схожа з попередніми поколіннями, що дозволяє зробити заміну пристроїв на автомобілі помінявши тільки блок управління.",
            "* Пристрій передбачає наявність однієї конфігураційної програми для всіх блоків управління Q-серії. Це дозволило розширити діапазон моделей автомобілів, на який можна встановити даний комплекс.",
            "* Stag 300 QMAX оснащений новітньою системою ISA3. Вона дозволяє проводити автоадаптацію і коригувати подачу палива в режимі реального часу.",
            "* Контролер виконаний в корпусі з композитного пластику, що поглинає шкідливі електромагнітні впливи, які можуть поміщати роботі системи.",
            "\"Світ ГБО\" представляє Вашій увазі лінійку найбільш затребуваних",
            "Країна-виробник товару: Польща"
        ]
    },
    {
        img : [
            require("../Images/ShopItemImages/adapter_tomasetto/1.webp"),
            require("../Images/ShopItemImages/adapter_tomasetto/2.webp"),
            require("../Images/ShopItemImages/adapter_tomasetto/3.webp")
        ],
        headline : "Перехідник (адаптер) до ВЗП короткий Tomasetto",
        price : 160,
        brand : "Tomasetto",
        condition : "Б/в",
        amount : 24,
        description: [
            "Перехідник до ВЗУ в люк бензобака застосовується для заправки балона газом.",
            "Підходить для заправних пістолетів українського зразка. Перехідник до ВЗУ використовується тільки під час заправки. Після закінчення його можна викрутити і заховати в салоні автомобіля.",
            "Для того щоб уникнути запаху, використовують спеціальний чохол.",
            "Країна-виробник товару: Італія"
        ]
    },
    {
        img : [
            require("../Images/ShopItemImages/peremukach_stag/1.webp"),
            require("../Images/ShopItemImages/peremukach_stag/2.webp")
        ],
        headline : "Перемикач Stag LED-200",
        price : 292,
        brand : "Stag",
        condition : "Новий",
        amount : 9,
        description: [
            "Цифровий трипровідний перемикач, призначений для встановлення автогазу, з блоком управління STAG GoFast.",
            "Перемикач виконує ряд функцій, починаючи від вибору оптичної та акустичної сигналізації, що повідомляє про режим роботи, і закінчуючи показанням рівня газу в автомобілях з установкою, адаптованою для подачі в приводну систему альтернативного джерела живлення, зокрема, газоподібного палива.",
            "Основні характеристики та переваги LED GoFast:",
            "1. компактна конструкція невеликого розміру",
            "2. всього три дроти для підключення, що скорочує час монтажу",
            "3. виконує функцію датчика рівня палива та сигналізує про різні режими роботи",
            "4. вбудований зумер",
            "Використовується в газових установках фірми Stag 200 GoFast",
            "Країна-виробник товару: Польща"
        ]
    },
    {
        img : [
            require("../Images/ShopItemImages/forsunki_aeb/1.webp"),
            require("../Images/ShopItemImages/forsunki_aeb/2.webp"),
            require("../Images/ShopItemImages/forsunki_aeb/3.webp"),
            require("../Images/ShopItemImages/forsunki_aeb/4.webp")
        ],
        headline : "Газові форсунки AEB I-Plus 4 цил",
        price : 1698,
        brand : "AEB",
        condition : "Новий",
        amount : 4,
        description: [
            "Інжекторна рейка четветрого покоління на 4 циліндри для LPG/CNG:",
            "Можна встановлювати в автомобілі потужністю до 60 к.с. на циліндр",
            "Не вимагає регулювання ходу",
            "Мембранного типу",
            "Повний комплект",
            "Країна-виробник товару: Італія"
        ]
    },
    {
        img : [
            require("../Images/ShopItemImages/forsunki_aeb/1.webp"),
            require("../Images/ShopItemImages/forsunki_aeb/2.webp"),
            require("../Images/ShopItemImages/forsunki_aeb/3.webp"),
            require("../Images/ShopItemImages/forsunki_aeb/4.webp")
        ],
        headline : "Ремкомплект для форсунок Valtek 4cyl (4шт)",
        price : 290,
        brand : "Valtek",
        condition : "Новий",
        amount : 30,
        description: [
            "Ремкомплекти для газових форсунок Valtek 4cyl.",
            "У комплект входить:",
            "Шток із уже встановленими гумовими ущільнювачами - 4шт",
            "Пружина штока - 4шт",
            "Кільце ущільнювача для корпусу штока - 4шт",
            "Даний набір призначений для форсунок на 4 цил.",
            "Країна-виробник товару: Італія"
        ]
    },
    {
        img : [
            "https://content2.rozetka.com.ua/goods/images/big/305839236.jpg",
            "https://content2.rozetka.com.ua/goods/images/big/305839240.jpg"
        ],
        headline : "Bluetooth адаптер для діагностики ГБО",
        price : 350,
        brand : "Без виробника",
        condition : "Новий",
        amount : 18,
        description: [
            "Біспровідна Адаптера ГБО Bluetooth-LPG. Заміна для налаштування ГБО обладнання з використанням бездротових технологій Bluetooth. Повністю замінює кабель. Адаптер виготовлений промисловим методом.",
            "Звертаємо увагу на те, що для роботи Bluetooth адапттер для ГБО не потрібно встановити жодних драйверів. Програмне забезпечення також використовується для кабелів.",
            "Так само для цих ГБО доступна програма для смартфонів і планшетів на Андроїд Stag Mobile.",
            "Країна-виробник товару: Україна"
        ]
    },
    {
        img : [
            "https://content.rozetka.com.ua/goods/images/big/17667493.jpg"
        ],
        headline : "Фільтр-вкладиш газового редуктора Tomasetto AT09/AT07/AT13",
        price : 60,
        brand : "Tomasetto",
        condition : "Новий",
        amount : 124,
        description: [
            "Змінний фільтр-вкладиш газового редуктора Tomasetto AT з ущільнювальними кільцями.",
            "Застосовується для заміни в моделях редукторів моделей Tomasetto: AT07, AT09 Alaska Nordic Artic, AT13.",
            "Періодичність заміни фільтроелемента становить 15-20 тис км.",
            "Країна-виробник товару: Польща"
        ]
    },
    {
        img : [
            "https://content2.rozetka.com.ua/goods/images/big/296638495.jpg",
            "https://content2.rozetka.com.ua/goods/images/big/296638496.jpg"
        ],
        headline : "Штуцер у колектор розбірний з тефлоновим подовжувачем D6",
        price : 146,
        brand : "Без виробника",
        condition : "Новий",
        amount : 30,
        description: [
            "Штуцер у колектор розбірний з тефлоновим подовжувачем D6 (гайка + ніпель + муфта + тефлонова трубка - 25см.)",
            "Країна-виробник товару: Італія"
        ]
    }
]

