export const aboutUsInformation = [
    {
        headline : "Робимо ваш автомобіль економічніше та екологічніше!",
        text : [
            "Ми – експерти з встановлення газобалонного обладнання на автомобілі, які мають понад 5 років досвіду у цій сфері. Ми гарантуємо швидку та якісну установку обладнання, з урахуванням усіх вимог та норм.",
            "Ми також допомагаємо нашим клієнтам у сертифікації обладнання, щоб гарантувати їхню безпеку та відповідність усім стандартам.",
            "Наша компанія прагне забезпечити максимальну зручність та комфорт нашим клієнтам, надаючи широкий спектр послуг із встановлення та обслуговування газобалонного обладнання.",
            "Звертайтесь до нас, і ми із задоволенням допоможемо вам заощаджувати на паливі та покращувати екологічні показники вашого автомобіля.",
        ],
        img : require("../Images/about_us.jpg")
    }
]

export const aboutUsAdvantages = [
  "Понад 5 років досвіду в установці газобалонного обладнання",
  "Якісне та швидке встановлення обладнання з урахуванням норм та вимог",
  "Допомога у сертифікації обладнання для гарантованої безпеки клієнтів",
  "Широкий спектр послуг з встановлення та обслуговування газобалонного обладнання.",
  "Збільшення економії на паливі та покращення екологічних показників автомобіля клієнта.",
  "Доступність та гнучкий графік роботи",
  "Кваліфіковані спеціалісти з великим досвідом роботи",
  "Гарантія на виконані роботи та встановлене обладнання",
  "Використання якісних запчастин та комплектуючих під час встановлення",
  "Наявність професійного обладнання та інструментів для роботи",
]

export const homeInfo = [
    {
        headline : "Вигоди ГБО від Monogas",
        text : [
            "ГБО від Monogas – ГБО від найкращої автогазової СТО",
            "Впевненість. Monogas – це професійний монтаж, гарантія якості та кваліфіковане обслуговування.",
            "Безпека. Жодних б/в балонів та обладнання. Ми не використовуємо нелегальне обладнання, підробки та копії.",
            "Якість. ГБО монтується відповідно до технологічних карт. Проведення та рукави укладаються в гофри.",
            "Економічність. Сучасне ГБО дозволяє суттєво знизити витрати на паливо та обслуговування автомобіля."        ],
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg")
    },
    {
        headline : "Етапи встановлення ГБО",
        text : [
            "1. Ви отримуєте докладну консультацію з підбором оптимальних комплектуючих для вашого автомобіля.",
            "2. Приганяєте автомобіль на СТО та після діагностики наші майстри встановлюють на нього ГБО.",
            "3. Монтаж газобалонного обладнання та його ретельне налаштування займають приблизно 1 робочий день.",
            "4. Ви забираєте переобладнаний автомобіль та весь пакет документів для перереєстрації."
        ],
        img : require("../Images/car_with_hood_up.avif")
    },
    {
        headline : "Monogas - це:",
        text : [
            "Досвідчені майстри ГБО. Ми вирішуємо будь-які завдання у сфері ГБО та гарантуємо кваліфіковане обслуговування вашого автомобіля.",
            "Обслуговуємо на 100%. Незалежно від того, де та яке ГБО ви встановили, наші майстри нададуть допомогу та підтримку з будь-яких питань у сфері ГБО.",
            "Сертифікація ГБО. Надаємо допомогу в одержанні сертифікації на газобалонне обладнання."

        ],
        img : require("../Images/cool_black_car_with_monogas.png")
    }
]

export const servicesName = [
    {
        title : "Установка ГБО 2-го покоління",
        path : "second_generation",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
            {
                headline : "Переваги використання газобалонної системи 2-го покоління",
                content : [
                    "Простота і надійність конструкції, мінімальну присутність електроніки, висока ремонтопридатність в звичайних умовах, доступна непрофесіоналові настройка і діагностика, недороге обладнання і вартість його монтажу.",
                    "Залежно від двигуна вашого автомобіля використовуються і різні покоління газобалонного обладнання. Класичне і досить поширене ГБО 2 покоління використовують для установки на карбюраторні двигуни, мотори з одною бензиновою форсункою чи інжекторним впорскуванням палива. Враховуючи ймовірність виникнення зворотних хлопків важливою технічною умовою установки ГБО 2 покоління є металевий впускний колектор. У автомобілів після 2001 року колектор може бути виконаний з пластика, а значить він потребує ГБО 4 покоління."
                ],
            },
            {
                headline : "Переваги ГБО 2 покоління",
                content : [
                    "Це найпростіша система впорскування газового палива. Вона невибаглива до установки, експлуатації і ремонту. Її монтаж не вимагає висококваліфікованого обслуговування; це переважно механічний пристрій, з мінімумом електронних вузлів і відсутністю складної програмної складової. Придбати ГБО 2 покоління можна в інтернет-магазині AutogasMarket."
                ]
            },
            {
                headline : "Конструкція і принцип дії",
                content : [
                    "У балоні, що традиційно встановлюється в кормовій частині автомобіля, пропан-бутан міститься в рідкій фазі під тиском до 16 атмосфер. Через мультиклапан газ під тиском подається в паливну (газову) магістраль, яка і підводить його в підкапотний простір. Тут на вході пропан-бутан спочатку потрапляє в електроклапан з вбудованим паливним фільтром, який уловлює і відокремлює з газу смоляні і тверді речовини."
                ],
                img : require("../Images/second_generation_page.jpg"),
            },
            {
                content : [
                    "При активації режиму їзди на газі, електроклапан відкривається, і рідкий пропан-бутан надходить у двоступеневий вакуумний або електронний редуктор-регулятор. Тут він переводиться з рідкої фази в парову, за рахунок підігріву редуктора від системи охолодження, а тиск газу знижується в першій камері до 2 атм. і далі в другій до 0,5 атм. Після цього під впливом розрідження утвореного всередині впускного колектора працюючого мотора, газ з другого ступеня редуктора всмоктується через змішувач і надходить у карбюратор або колектор (інжекторний варіант), після чого подається в циліндри."
                ],
            },
            {
                headline : "Вартість переходу на ГБО 2 покоління",
                content : [
                    "Завдяки компанії Profigas переобладнання вашого автомобіля буде економічно вигідним. Ми пропонуємо лояльні ціни не обладнання і його монтаж, а також сервісне і гарантійне обслуговування. Доступні наступні варіанти компоновки ГБО другого покоління:",
                    "Система живлення «Карбюратор» включає клапан бензину, редуктор, перемикач газ / бензин, змішувач і дозатор газу. Відповідно моделі автомобіля підбирається балон з мультиклапаном. Ціна – від 8000 грн.",
                    "Система живлення «Інжектор» – крім стандартного набору, в систему додається емулятор бензинових форсунок. Ціна для моноінжектора – від 8500 грн., Інжектора – від 9000 грн."
                ]
            },
        ]
    },
    {
        title : "Установка ГБО 4-го покоління",
        path : "fourth_generation",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
            {
                headline : "Що привнесли газобалонні системи 4-покоління",
                content : [
                    "Порівняно недавно газове обладнання 4 покоління набуло поширення. Воно набагато ефективніше, ніж попередні системи, так як дозволяє здійснювати управління роботою двигуна, орієнтуючись на показання датчиків. Варто зауважити, що використовується таке обладнання на автомобілях з інжекторною системою уприскування. ",
                    "По-перше, виникає необхідність у калібрування, яка проводиться за даними, отриманими зі штатних бензинових форсунок.",
                    "По-друге, в роботі бере участь безліч датчиків – витрати повітря, положення дросельної заслінки, детонації, швидкості та інші."
                ],
            },
            {
                headline : "Переваги ГБО 4 покоління",
                content : [
                    "Слід виділити відмітні особливості ГБО 4-го покоління, які характеризують позитивні якості, в порівнянні з попередніми системами:",
                    "При проведенні встановлення обладнання неможливо допустити помилки, робота проводиться досить просто за рахунок того, що всі з’єднання проводів мають виконання у вигляді різних роз’ємів, сплутати їх неможливо, тому ризик неправильного підключення виключено;",
                    "Витрата палива (газу) мінімальний за рахунок використання микроконтроллерной системи управління роботою обладнання;",
                    "Автомобіль, обладнаний ГБО 4-го покоління, відповідає нормам токсичності Євро-2, Євро-3 і Євро-4;"
                ]
            },
            {
                headline : "Основні вузли ГБО 4 покоління",
                content : [
                    "Для зберігання стисненого газу використовується балон. До нього пред’являються певні вимоги – герметичність, надійність, міцність. Для використання газового балона на автомобілі потрібен дозвіл. Видати його можуть тільки фахівці, у яких є ліцензія для здійснення даної процедури. Так як впорскування газу відбувається під тиском, меншим ніж те, яке в балоні, то необхідно його знижувати. Для цієї мети використовується редуктор. В метанових установках вони мають два ступені зниження тиску, а в пропан-бутанових достатньо однієї. Причина – у першому випадку тиск у балоні може досягати значення до 200 Атмосфер, у другому – до 16."
                ],
                img : require("../Images/fourth_generation_page.jpg"),
            },
            {
                content :[
                    "Газові форсунки необхідні для вприскування палива в камеру згоряння. Вони з’єднані з редуктором-випарником. Управління всією системою здійснюється за допомогою електронної начинки – ЕБУ, яка працює завдяки мікропроцесору. В нього закладається прошивка, яка забезпечує роботу згідно заздалегідь продуманим алгоритмом. Газове обладнання 4 покоління має перевагу перед більш ранніми – вибір палива відбувається автоматично, без участі водія. Для цього тільки й потрібно, що встановити перемикати газ-бензин в перше положення."
                ],
            },
            {
                headline : "Як працює ЕБУ?",
                content : [
                    "При роботі проводиться зчитування даних, які надходять від датчиків. Зокрема, проводиться аналіз сигналів, що йдуть від лямбда-зондів – один встановлений до катколлектора, другий – після. Один основний, а інший є коригуючих. Всі параметри, лічені з датчиків надходять на вхід мікропроцесора.",
                    "Але тут виникає невелика проблема – рівень сигналу в одних зчитувальних пристроїв великий, а в інших – занадто маленький. Для узгодження датчиків і портів введення мікроконтролера використовуються узгоджувальні пристрої.",
                ]
            },
        ]
    },
    {
        title :  "Установка ГБО на FSI, TSI, GDI",
        path : "fsi_tsi_gdi",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
            {
                headline : "Що ховається за цими літерами?",
                content : [
                    "FSI – Fuel Stratified Injection (дослівно – пошарове упорскування палива) – атмосферні бензинові двигуни з безпосереднім упорскуванням палива, що встановлюються на автомобілі концерну VAG. Історія цих двигунів почалася в 2000 році після того, як перший серійний зразок був встановлений на Volkswagen. А на сьогоднішній день мотори із шильдиком FSI встановлюються лише на VolksWagen Touareg 4 WD.",
                    "TSI (TFSI) – Turbo Stratified Injection (турбоване пошарове упорскування) – це, по суті, FSI мотор, оснащений турбіною. Тому детально розглядати його ми не будемо, зазначимо лише, що TSI від TSFI відрізняється лише тим, що перші встановлюються на автомобілі VolksWagen, а другі на Audi. Ось такий кумедний маркетинговий хід, спрямований на популяризацію автомобілів дорожчого бренду!",
                    "GDI – Gasoline Direct Injection (дослівно – пряме упорскування бензину) – інжекторна система подачі палива для бензинових двигунів внутрішнього згоряння з безпосереднім упорскуванням палива. Використовується у автомобілях марки Mitsubishi."
                ],
            },
            {
                headline : "Принципові відмінності та особливості систем FSI/TSI",
                content : [
                    "Головна відмінність двигунів з технологіями TSI та FSI від звичайних ДВЗ – те, що подача палива здійснюється безпосередньо в камеру згоряння двигуна.",
                    "Примітний і той факт, що паливна система цих автомобілів оснащена другим контуром високого тиску, який дозволяє здійснювати подачу бензину точніше, що суттєво позначається на потужності двигуна та мінімалізації витрат палива.",
                    "Залежно від навантаження на двигун тиск бензину в паливній системі може коливатися в межах 0,5-0,05 МПа. А це означає, що якісь вищі сили відповідають за ухвалення рішення, під яким тиском подавати паливо зараз. І ці найвищі сили – окремий електронний блок управління."
                ]
            },
            {
                headline : "Конструкція і принцип дії",
                content : [
                    "У балоні, що традиційно встановлюється в кормовій частині автомобіля, пропан-бутан міститься в рідкій фазі під тиском до 16 атмосфер. Через мультиклапан газ під тиском подається в паливну (газову) магістраль, яка і підводить його в підкапотний простір. Тут на вході пропан-бутан спочатку потрапляє в електроклапан з вбудованим паливним фільтром, який уловлює і відокремлює з газу смоляні і тверді речовини."
                ],
                img : require("../Images/fsi_page.jpg"),
            },
            {
                content : [
                    "При безпосередньому впорскуванні бензинова форсунка, що піддається дії високої температури дуже швидко закоксовується і вигоряє якщо через неї не подається паливо. Для вирішення даної проблеми застосовується технологія довпирскування мінімальної дози бензину через форсунки при роботі двигуна на газовому паливі."
                ],
            },
        ]
    },
    {
        title : "Установка ГБО на електромобілі",
        path : "electric_car",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
            {
                headline : "В Україні масово встановлюють ГБО в електромобілі",
                content : [
                    "Наразі в Україні стали масово встановлювати газобалонне обладнання на підтримані електроавтомобілі. Це робиться для того, щоб покращити та збільшити запас ходу та підвищити рівень комфорту.",
                ],
                img : require("../Images/electro_page.jpg")
            },
            {
                content : [
                    "Так Так! Саме такою установкою ГБО автовласники іменитих електромобілів вирішують проблему невеликого запасу ходу, але вони не повністю переоснащують авто під їзду на пропан-бутані, а застосовують газ для зменшення витрати електрики.",
                    "У цьому випадку газовою системою виступає не саме обладнання, а піч та підключений до неї газовий балон. За допомогою автономної пічки можна знизити або взагалі не витрачати енергію акумулятора на обігрів салону і таким чином збільшити запас ходу."
                ]
            },
            {
                headline : "Відомі представники",
                content : [
                    "Також серед користувачів газової печі є відомі е-мобілі, такі як Nissan Leaf та Renault Zoe – ціна подібної печі варіюється від 8 до 15 тис. грн. ",
                    "Все залежить від моделі та функціоналу обігрівача. Адже, на ринку цього товару є недорогі пристрої китайського виробництва та дорожчого – це австрійського та німецького виробництва.",
                    "Хоча, встановлюючи подібне обладнання на електромобіль, воно може окупитися, наприклад, при роботі \"в режимі таксі\". А якщо його встановити для себе, то подібне ГБО забезпечить комфортом і невеликою економією коштів.",
                ],
            },
        ]
    },
    {
        title : "Установка ГБО на дизель",
        path : "diesel",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
            {
                headline : "Переваги газодизельних систем",
                content : [
                    "Економія паливних витрат до 40%;",
                    "Щадний режим роботи паливної системи;",
                    "Покращення згоряння дизельного палива;",
                    "Постійно чистий фільтр сажі;",
                    "М'яка, плавна робота двигуна;",
                    "Приріст потужності до 15%;",
                    "Збільшення запасу ходу до 50%.",
                    "Зростання цін на дизельне паливо робить економічно виправданим оснащення автомобілів із дизельними двигунами газобалонним обладнанням. Установка ГБО разом із дизелем виправдана для вантажних машин, пасажирського транспорту та сільськогосподарської техніки. При схемі \"газ на дизель\" дизельне паливо використовується для запалювання паливо-повітряної суміші. Паралельна робота на обох видах палива дозволить заправляти солярку, якщо поблизу немає газозаправної станції.",
                ],
            },
            {
                headline : "Вигоди спільного використання газового обладнання та дизеля",
                content : [
                    "Окрім очевидної економічної вигоди від різниці цін, монтаж ГБО на дизель зменшує знос механізмів двигуна та викиди в атмосферу.",
                    "Паливо вигоряє значно більшою мірою, що зменшує накопичення гару на деталях двигуна та вміст шкідливих речовин у вихлопі.",
                    "Переробка паливної системи не вимагає радикальних змін конструкції та складних технічних хитрощів, при цьому не знижуючи, а підвищуючи ресурс механізмів та забезпечуючи цілу низку переваг.",
                ]
            },
            {
                headline : "ГБО для дизельного транспорту має наступний принцип роботи",
                content : [
                    "Установка на штатний паливний насос дозуючого пристрою (залишається можливість роботи також на дизельному паливі у звичайному режимі), яке набирає чинності при подачі на нього електрики;",
                    "Дозуючий пристрій обмежує подачу солярки та дозволяє оптимізувати її використання при різних навантаженнях;",
                    "Подача газу до впускного колектора в достатній пропорції з потраплянням безпосередньо в циліндри;",
                    "На останній стадії такту стиснення в циліндри подається запальна доза дизельного палива та здійснюється запалення газово-повітряної суміші.",
                    "Система налаштована таким чином, що на холостому ходу автомобіль працює тільки на дизелі, а при збільшенні обертів та підвищеному навантаженні здійснюється процес заміщення."
                ],
                img : require("../Images/diesel_page.jpg"),
            },
            {
                headline : "Серед мінусів використання ГБО слід зазначити",
                content : [
                    "Висока початкова вартість. Середня ціна складає близько 500 євро.",
                    "Зниження потужності проти бензином.",
                    "Необхідність переобладнання транспортного засобу.",
                    "Високі витрати обслуговування системи. Кожні 15 тис. км. необхідно змінювати фільтр. Планові перевірки відбуваються кожні 250 тис. км пробігу.",
                    "Зниження місткості багажника.",
                    "Необхідність реєстрації обладнання.",
                    "Проблеми з продажем авто із ГБО. Деякі покупці можуть бути противниками переобладнання та відмовляться брати машину.",
                ]
            },
        ]
    }    
]

export const ourProjectsHedlines = [
    {
        headline : "Всі роботи",
    },
    {
        headline : "Монтаж",
    },
    {
        headline : "Сервіс",
    }
]

export const works = [
    {
        model : "Chevrolet Volt 1.4L (HYBRID) 2012",
        type : "Монтаж",
        img : require("../Images/volt_1.jpg"),
        cost : "900$",
        subImage : [
            require("../Images/volt_1.jpg"),
            require("../Images/volt_2.jpg"),
            require("../Images/volt_3.jpg"),
            require("../Images/volt_4.jpg"),
        ],
        avtoInfo : [
            "Chevrolet",
            "Volt",
            "2012",
            "1.4L (Гібрид)",
            "Автомат",
            "90.000 км",
            "Передній привід",
        ],
        text : [
            "ГБО на Chevrolet Volt - екологічне паливо Поки ціни на бензин продовжують збільшуватися, більш практичні автомобілісти оперативно переходять на газобалонне обладнання. Chevrolet Volt - одна з кращих моделей в лінійці марки і багато її власники переобладнають свої автомобілі на газ.",
            "Придбати і встановити ГБО Ви можете в нас, компанії «Monogas». Перехід на газобалонне обладнання - практичне рішення для власників Chevrolet Volt.",
            "Балон з газом в Шевроле монтується також, як і в багатьох інших авто: в багажнику, на місці «запаски». Вибрати газ на Chevrolet Volt в компанії «Monogas» - означає придбати якісний пристрій за привабливою вартістю.",
        ]
    },
    {
        model : "Audi Q7 2006",
        type : "Сервіс",
        img : require("../Images/audi_1.jpg"),
        cost : "650грн",
        subImage : [
            require("../Images/audi_1.jpg"),
            require("../Images/audi_2.jpg"),
            require("../Images/audi_3.jpg"),
            require("../Images/audi_4.jpg"),
        ],
        avtoInfo : [
            "Audi",
            "Q7",
            "2006",
            "3L (Дизель)",
            "Автомат",
            "209.000 км",
            "Повний привід",
        ],
        text : [
            "Газ на Audi - просто і надійно Німецькі автомобілі Audi дуже популярні і цим пояснюється їх велика кількість серед машин, переобладнаних компанією «Monogas».",
            "Багато установників відмовляються ставити ГБО на Audi тільки з остраху, що преміальний бренд виявиться їм не по зубах і лише професіонали компанії «Monogas» готові переобладнати Audi. A4, A6, A8, моделі Quattro або кроссовери Q-серії вміють економити паливо і можуть бути переобладнані на газ.",
            "Переобладнання Audi на газ завдання не найпростіше, але ми допоможемо Вам вибрати газобалонне обладнання, встановимо його на автомобіль і надамо весь спектр супутніх послуг.",
        ]
    },
    {
        model : "BMW X5 2003",
        type : "Монтаж",
        img : require("../Images/bmw_1.jpg"),
        cost : "500$",
        subImage : [
            require("../Images/bmw_1.jpg"),
            require("../Images/bmw_2.jpg"),
            require("../Images/bmw_3.jpg"),
            require("../Images/bmw_4.jpg"),
        ],
        avtoInfo : [
            "BMW",
            "X5",
            "2003",
            "3L (Бензин)",
            "Автомат",
            "320.000 км",
            "Повний привід",
        ],
        text : [
            "Переобладнання BMW – газ на преміум Автомобілі BMW запросто можуть бути переобладнані на газ. Деякі моделі цього виробника навіть у заводському виконанні мають поширене в Європі метанове ГБО. ",
            "Мотори BMW добре переносять переобладнання на газ і легко налаштовуються на оптимальну роботу. Компанія «Monogas» пропонує грамотну установку газу на BMW, що не тільки не зашкодить, але і піде на користь, тому що газ не містить домішок і присадок на відміну від бензину.",
            " При установці газу на BMW непогано себе зарекомендували люкс-комплектації ГБО. З надійним обладнанням від компанії «Monogas» у вас не виникне жодних проблем.",
        ]
    },
    {
        model : "Citroen C-Crosser 2008",
        type : "Сервіс",
        img : require("../Images/citroen_1.jpg"),
        cost : "350грн",
        subImage : [
            require("../Images/citroen_1.jpg"),
            require("../Images/citroen_2.jpg"),
            require("../Images/citroen_3.jpg"),
            require("../Images/citroen_4.jpg"),
        ],
        avtoInfo : [
            "Citroen",
            "C-Crosser",
            "2008",
            "2.4L (Дизель)",
            "Механіка",
            "208.000 км",
            "Повний привід",
        ],
        text : [
            "ГБО на Citroen: вирішення питання Французькі автомобілі користуються у нас величезною популярністю. Їх експлуатація не вимагає великих витрат але витрати на паливо однозначно можна зменшити за допомогою установки ГБО на Citroen.",
            "Переобладнання на газ дозволяє зробити Citroen екологічніше і при цьому заощадити гроші на паливі. На ці Citroen крім основних елементів ГБО найчастіше встановлюють емулятор рівня палива, і навіть варіатор кута випередження запалювання.",
            "При правильному налаштуванні ГБО на Citroen газова система функціонує не гірше штатної бензинової. Так що переобладнання Citroen на газ цілком виправдане рішення.",
        ]
    }
]

export const servicesInfoInstallation = [
    {
        headline : "Установка ГБО 2-го покоління",
        text : [
            "Вартість встановлення: від 260$",
            "Встановлюється інжекторні двигуни.",
            "Газ під власним тиском виходить по видатковій магістралі з балона до редуктора, там тиск знижується до робочого, і газ перетворюється з рідкого в газоподібний стан, нагріваючись при цьому."
        ],
        img : require("../Images/second_generation.jpg"),
        path : "second_generation"
    },
    {
        headline : "Установка ГБО 4-го покоління",
        text : [
            "Вартість встановлення:",
            "4 циліндри - від 390$",
            "6 циліндри - від 700$",
            "8 циліндри - від 900$",
            "ГБО 4 покоління – використовує систему циклічної подачі газу.",
            "За рахунок фазованого упорскування з'явилася можливість зменшити витрату палива, значно знизити кількість викидів у навколишнє середовище, знизити навантаження на випускні клапани та циліндро-поршневу систему, а також підвищити динамічні характеристики."
        ],
        img : require("../Images/fouth_generation.webp"),
        path : "fourth_generation"
    },
    {
        headline : "Установка ГБО на FSI, TSI, GDI",
        text : [
            "Вартість встановлення:",
            "4 циліндри - від 1000$",
            "6 циліндри - від 1200$",
            "8 циліндри - від 1400$",
            "ГБО на двигун TSI, GDI, TSI повинен гармонійно вписуватися в решту електроніки вашого автомобіля.",
            "«Рідна» прошивка, а також прошивка ГБО мають працювати злагоджено та не конфліктувати. Існують також універсальні варіанти, що підходять під будь-яку прошивку."
        ],
        img : require("../Images/tsi_fsi_tfsi.jpg"),
        path : "fsi_tsi_gdi"
    },
    {
        headline : "Установка ГБО на електромобілі",
        text : [
            "Вартість встановлення: від 500$",
            "У цьому випадку газовою системою виступає не саме обладнання, а піч та підключений до неї газовий балон.",
            "За допомогою автономної пічки можна знизити або взагалі не витрачати енергію акумулятора на обігрів салону і таким чином збільшити запас ходу."
        ],
        img : require("../Images/electro_car.jpg"),
        path : "electric_car"
    },
    {
        headline : "Установка ГБО на дизель",
        text : [
            "Вартість встановлення:",
            "4 циліндри - від 1350$",
            "6 циліндри - від 1470$",
            "Ступінь заміщення дизеля газом залежить від конструкції газобалонного обладнання та двигуна автомобіля. Має значення та навантаження на двигун.",
            "При досягненні співвідношення обох видів пального 80:20 пропадає характерний дизельних моторів вихлоп чорного диму. Дана схема - одна з небагатьох на ринку, що оптимізує роботу двигуна відразу за всіма параметрами."
        ],
        img : require("../Images/disel.png"),
        path : "diesel"
    }
]

export const tableText = [
    {
        title : "Перевірка герметичності системи",
        time :  "20-45 хв",
        cost : "160-360"
    },
    {
        title : "ТО-1-10 ГБО 4-го покоління (4, 6, 8 циліндри)",
        time : "1 год – 1 год 10 хв",
        cost : "480-650"
    },
    {
        title : "Проведення технічного обслуговування ГБО (4, 6, 8 циліндрів)",
        time : "70-95 хв",
        cost : "530-775"
    },
    {
        title : "Діагностика автомобіля",
        time : "14 хв",
        cost : "115"
    },
    {
        title : "Комп’ютерна діагностика",
        time : "38 хв",
        cost : "280"
    },
    {
        title : "Перевірка системи запалювання",
        time : "30 хв – 1 год",
        cost : "240-480"
    },
    {
        title : "Регулювання ГБО 2-го покоління",
        time : "30 хв",
        cost : "240"
    },
    {
        title : "Регулювання ГБО 2-го покоління на газоаналізаторі",
        time : "35 хв",
        cost : "285"
    },
    {
        title : "Комп’ютерне регулювання системи впорскування в русі з відстеженням паливних корекцій по OBDII",
        time : "56 хв",
        cost : "450"
    },
    {
        title : "Демонтаж/монтаж редуктора",
        time : "40 хв",
        cost : "320"
    },
    {
        title : "Заміна газового трубопроводу",
        time : "1-3 год",
        cost : "480-1440"
    },
    {
        title : "Капітальний ремонт редуктора: (розбирання, промивка, притирання клапанів, заміна ремкомплекту, збирання, перевірка на стенді, тарирування)",
        time : "1 год 20 хв",
        cost : "645"
    },
    {
        title : "Демонтаж/монтаж форсуночної рейки (групи форсунок)",
        time : "30 хв",
        cost : "240"
    },
    {
        title : "Промивка газової форсунки на стенді (1 шт)",
        time :  "15 хв",
        cost : "140"
    },
    {
        title : "Тарирування форсунки (1 шт)",
        time : "10 хв",
        cost : "85"
    },
    {
        title : "Демонтаж/монтаж балона",
        time : "30 хв – 2 год",
        cost : "240-960"
    },
    {
        title : "Демонтаж /монтаж мультиклапана",
        time : "30 хв – 2 год",
        cost : "240-960"
    },
    {
        title : "Заміна газової магістралі",
        time : "1 – 3 год",
        cost : "480-1440"
    },
    {
        title : "Перевірка герметичності системи впускного тракту за допомогою димогенератора",
        time : "30-60 хв",
        cost : "240-480"
    },
    {
        title : "Усунення витоку газу",
        time : "10-30 хв",
        cost : "80-240"
    },
    {
        title : "Заміна рукава (бензинового, газового, вакуумного)",
        time : "8 хв",
        cost : "70"
    },
    {
        title : "Заміна рукава системи охолодження",
        time : "20 хв",
        cost : "165"
    },
    {
        title : "Заміна фільтра рідкої фази в редукторі",
        time : "20 хв",
        cost : "165"
    },
    {
        title : "Заміна фільтра рідкої фази в клапані газу",
        time : "10 хв",
        cost : "165"
    },
    {
        title : "Заміна фільтра парової фази",
        time : "20 хв",
        cost : "85"
    },
    {
        title : "Заміна свічки запалювання (1 шт.)",
        time : "10 хв",
        cost : "85"
    }

]

export const shopFilter = [
    {
        headline : "Бренд",
        brands : [
            "Hana",
            "Tomasetto",
            "Zenit",
            "Alex",
            "Atiker",
            "Digitronic",
            "KME",
            "LPGTECH",
            "Parts Master",
            "Stag"
        ]
    },
    {
        headline : "Новий - б/в ",
        items : [
            "Новий",
            "Б/в"
        ]
    },
    {
        headline : "Статус товару",
        items : [
            "Є в наявності",
            "Нема в наявності"
        ]
    }
]

export const shopItems = [
    {
        img : require("../Images/ShopItemImages/remcomplect_tomas.jpg"),
        headline : "Ремкомплект редуктора Tomasetto AT-07 повний",
        price : "391",
        brand : "Tomasetto",
        condition : "Новий",
        amount : 1
    },
    {
        img : require("../Images/ShopItemImages/forsunka_hana.webp"),
        headline : "Форсунка Hana 2001 Rail, Type B",
        price : "575",
        brand : "Hana",
        condition : "Новий",
        amount : 0
    },
    {
        img : require("../Images/ShopItemImages/reductor_tomas.webp"),
        headline : "Редуктор Tomasetto AT09 Nordic",
        price : "1376",
        brand : "Tomasetto",
        condition : "Б/в",
        amount : 5
    },
    {
        img : require("../Images/ShopItemImages/datchik_stag.webp"),
        headline : "Датчик тиску Stag PS-04 plus",
        price : "298",
        brand : "Stag",
        condition : "Новий",
        amount : 1
    },
    {
        img : require("../Images/ShopItemImages/datchik_stag.webp"),
        headline : "Датчик тиску та вакууму MAP Sensor Zenit",
        price : "1210",
        brand : "Zenit",
        condition : "Б/в",
        amount : 1
    },
    {
        img : require("../Images/ShopItemImages/zaslonka_master.webp"),
        headline : "Дросельна заслінка Parts Master",
        price : "3399",
        brand : "Parts Master",
        condition : "Новий",
        amount : 1
    },

]
