import "./Content.scss"
import "./Services.scss"
import {RequestButton} from "./RequestButton";
import {InfoBlock} from "./InfoBlock";
import {BelowHeaderImage} from "./BelowHeaderImage";
import {ArrowUp} from "./ArrowUp";
import {useRef, useEffect} from "react";

const servicesInfoInstallation = [
    {
        headline : "Установка ГБО 2-го покоління",
        text : [
            "Вартість встановлення: від 260$",
            "Встановлюється інжекторні двигуни.",
            "Газ під власним тиском виходить по видатковій магістралі з балона до редуктора, там тиск знижується до робочого, і газ перетворюється з рідкого в газоподібний стан, нагріваючись при цьому."
        ],
        img : require("../Images/second_generation.jpg"),
        path : "second_generation"
    },
    {
        headline : "Установка ГБО 4-го покоління",
        text : [
            "Вартість встановлення:",
            "4 циліндри - від 390$",
            "6 циліндри - від 700$",
            "8 циліндри - від 900$",
            "ГБО 4 покоління – використовує систему циклічної подачі газу.",
            "За рахунок фазованого упорскування з'явилася можливість зменшити витрату палива, значно знизити кількість викидів у навколишнє середовище, знизити навантаження на випускні клапани та циліндро-поршневу систему, а також підвищити динамічні характеристики."
        ],
        img : require("../Images/fouth_generation.webp"),
        path : "fourth_generation"
    },
    {
        headline : "Установка ГБО на FSI, TSI, GDI",
        text : [
            "Вартість встановлення:",
            "4 циліндри - від 1000$",
            "6 циліндри - від 1200$",
            "8 циліндри - від 1400$",
            "ГБО на двигун TSI, GDI, TSI повинен гармонійно вписуватися в решту електроніки вашого автомобіля.",
            "«Рідна» прошивка, а також прошивка ГБО мають працювати злагоджено та не конфліктувати. Існують також універсальні варіанти, що підходять під будь-яку прошивку."
        ],
        img : require("../Images/tsi_fsi_tfsi.jpg"),
        path : "fsi_tsi_gdi"
    },
    {
        headline : "Установка ГБО на електромобілі",
        text : [
            "Вартість встановлення: від 500$",
            "У цьому випадку газовою системою виступає не саме обладнання, а піч та підключений до неї газовий балон.",
            "За допомогою автономної пічки можна знизити або взагалі не витрачати енергію акумулятора на обігрів салону і таким чином збільшити запас ходу."
        ],
        img : require("../Images/electro_car.jpg"),
        path : "electric_car"
    },
    {
        headline : "Установка ГБО на дизель",
        text : [
            "Вартість встановлення:",
            "4 циліндри - від 1350$",
            "6 циліндри - від 1470$",
            "Ступінь заміщення дизеля газом залежить від конструкції газобалонного обладнання та двигуна автомобіля. Має значення та навантаження на двигун.",
            "При досягненні співвідношення обох видів пального 80:20 пропадає характерний дизельних моторів вихлоп чорного диму. Дана схема - одна з небагатьох на ринку, що оптимізує роботу двигуна відразу за всіма параметрами."
        ],
        img : require("../Images/disel.png"),
        path : "diesel"
    }
]

const servicesInfoService = [
    {
        headline : "Демонтаж/монтаж редуктора",
        text : [
            "Вартість: 320 гривень",
            "Орієнтовний час виконання: 40 хв",
            "Незалежно від того, встановлено на ваш автомобіль ГБО 4-го або 2-го покоління, в системі обов’язково присутній редуктор. Його головне завдання в зниженні тиску і випаровуванні газового палива, що надходить з балона. А від нормального функціонування редуктора безпосередньо залежить, і робота газобалонної системи в цілому.",
            "Збільшена витрата палива, відсутність тяги, несвоєчасні переходи з бензину на газ та інші нештатні ситуації цілком можуть служити сигналом до того, що редуктор вимагає обслуговування."
        ],
        img : require("../Images/cool_black_car_with_monogas.png"),
    },
    {
        headline : "Установка ....",
        text : [
            "Вартість встановлення:",
            "4 циліндри - від 1000$",
            "6 циліндри - від 1200$",
            "8 циліндри - від 1400$",
            "ГБО на двигун TSI, GDI, TSI повинен гармонійно вписуватися в решту електроніки вашого автомобіля.",
            "«Рідна» прошивка, а також прошивка ГБО мають працювати злагоджено та не конфліктувати. Існують також універсальні варіанти, що підходять під будь-яку прошивку."
        ],
        img : require("../Images/cool_black_car_with_monogas.png"),
    },
    {
        headline : "Установка ....",
        text : [
            "Вартість встановлення:",
            "4 циліндри - від 1000$",
            "6 циліндри - від 1200$",
            "8 циліндри - від 1400$",
            "ГБО на двигун TSI, GDI, TSI повинен гармонійно вписуватися в решту електроніки вашого автомобіля.",
            "«Рідна» прошивка, а також прошивка ГБО мають працювати злагоджено та не конфліктувати. Існують також універсальні варіанти, що підходять під будь-яку прошивку."
        ],
        img : require("../Images/cool_black_car_with_monogas.png"),
    }
]

const tableText = [
    {
        title : [
            "Перевірка герметичності системи",
            "ТО-1-10 ГБО 4-го покоління (4, 6, 8 циліндри)",
            "Проведення технічного обслуговування ГБО (4, 6, 8 циліндрів)",
            "Діагностика автомобіля",
            "Комп’ютерна діагностика",
            "Перевірка системи запалювання",
            "Регулювання ГБО 2-го покоління",
            "Регулювання ГБО 2-го покоління на газоаналізаторі",
            "Комп’ютерне регулювання системи впорскування в русі з відстеженням паливних корекцій по OBDII",
            "Демонтаж/монтаж редуктора",
            "Заміна газового трубопроводу",
            "Капітальний ремонт редуктора: (розбирання, промивка, притирання клапанів, заміна ремкомплекту, збирання, перевірка на стенді, тарирування)",
            "Демонтаж/монтаж форсуночної рейки (групи форсунок)",
            "Промивка газової форсунки на стенді (1 шт)",
            "Тарирування форсунки (1 шт)",
            "Демонтаж/монтаж балона",
            "Демонтаж /монтаж мультиклапана",
            "Заміна газової магістралі",
            "Перевірка герметичності системи впускного тракту за допомогою димогенератора",
            "Усунення витоку газу",
            "Заміна рукава (бензинового, газового, вакуумного)",
            "Заміна рукава системи охолодження",
            "Заміна фільтра рідкої фази в редукторі",
            "Заміна фільтра рідкої фази в клапані газу",
            "Заміна фільтра парової фази",
            "Заміна свічки запалювання (1 шт.)"
        ],
        time : [
            "20-45 хв",
            "1 год – 1 год 10 хв",
            "70-95 хв",
            "14 хв",
            "38 хв",
            "30 хв – 1 год",
            "30 хв",
            "35 хв",
            "56 хв",
            "40 хв",
            "1-3 год",
            "1 год 20 хв",
            "30 хв",
            "15 хв",
            "10 хв",
            "30 хв – 2 год",
            "30 хв – 2 год",
            "1 – 3 год",
            "30-60 хв",
            "10-30 хв",
            "8 хв",
            "20 хв",
            "20 хв",
            "20 хв",
            "10 хв",
            "10 хв"
        ],
        cost: [
            "160-360",
            "480-650",
            "530-775",
            "115",
            "280",
            "240-480",
            "240",
            "285",
            "450",
            "320",
            "480-1440",
            "645",
            "240",
            "140",
            "85",
            "240-960",
            "240-960",
            "480-1440",
            "240-480",
            "80-240",
            "70",
            "165",
            "165",
            "165",
            "85",
            "85"
        ]
    }
]

const Services = () =>{

    return (
        <div className="homeCont">
            <ArrowUp/>
            <BelowHeaderImage
                headline = "Послуги ГБО Monogas"
            />
            <div className="flexCenteredBlock">
                <h1 className="headerFontSize">Всі послуги для ГБО в єдиному автосервісі</h1>
                <RequestButton/>
            </div>
            <div className="separator"></div>
            <div className="flexCenteredBlock">
                <h1 className="headerFontSize">Монтаж ГБО</h1>
                {servicesInfoInstallation.map( (elm,i) => {
                    return (
                        <InfoBlock
                            index={i}
                            headline={elm.headline}
                            text={elm.text}
                            img={elm.img}
                            path={elm.path}
                        />
                    )
                })}
            </div>
            <div className="separator"></div>
            <div className="flexCenteredBlock">
                <h1 className="headerFontSize">Сервіс ГБО</h1>
            </div>
            <div className="tableCont">
                <div className="title">
                    <div className="headlineText">Найменування робіт</div>
                    {tableText[0].title.map((title,i) => {
                        if (i % 2 === 1) {
                            return (
                                <div className="text">
                                    {title}
                                </div>
                            )
                        } else {
                            return (
                                <div className="text backgroundTableRow">
                                    {title}
                                </div>
                            )
                        }
                    })}
                </div>
                <div className="time">
                    <div className="headlineText">Орієнтовний час виконання</div>
                    {tableText[0].time.map((time,i) => {
                        if (i % 2 === 1) {
                            return (
                                <div className="value">
                                    {time}
                                </div>
                            )
                        } else {
                            return (
                                <div className="value backgroundTableRow">
                                    {time}
                                </div>
                            )
                        }
                    })}
                </div>
                <div className="cost">
                    <div className="headlineText">Вартість, грн</div>
                    {tableText[0].cost.map((cost,i) => {
                        if (i % 2 === 1) {
                            return (
                                <div className="value">
                                    {cost}
                                </div>
                            )
                        } else {
                            return (
                                <div className="value backgroundTableRow">
                                    {cost}
                                </div>
                            )
                        }
                    })}
                </div>
            </div>
        </div>
    )

}

export {Services}