import "./Content.scss"
import "./SpecificService.scss"
import {useParams} from "react-router";
import {NotFoundPage} from "./NotFoundPage"
import {BelowHeaderImage} from "./BelowHeaderImage"
import {RequestButton} from "./RequestButton";
import {ArrowUp} from "./ArrowUp";

export const services = [
    {
        title : "Установка ГБО 2-го покоління",
        path : "second_generation",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
			{
				headline : "Переваги використання газобалонної системи 2-го покоління:",
				content : [
					"Простота і надійність конструкції, мінімальну присутність електроніки, висока ремонтопридатність в звичайних умовах, доступна непрофесіоналові настройка і діагностика, недороге обладнання і вартість його монтажу.",
					"Залежно від двигуна вашого автомобіля використовуються і різні покоління газобалонного обладнання. Класичне і досить поширене ГБО 2 покоління використовують для установки на карбюраторні двигуни, мотори з одною бензиновою форсункою чи інжекторним впорскуванням палива. Враховуючи ймовірність виникнення зворотних хлопків важливою технічною умовою установки ГБО 2 покоління є металевий впускний колектор. У автомобілів після 2001 року колектор може бути виконаний з пластика, а значить він потребує ГБО 4 покоління."
				],
			},
			{
				headline : "Переваги ГБО 2 покоління",
				content : [
					"Це найпростіша система впорскування газового палива. Вона невибаглива до установки, експлуатації і ремонту. Її монтаж не вимагає висококваліфікованого обслуговування; це переважно механічний пристрій, з мінімумом електронних вузлів і відсутністю складної програмної складової. Придбати ГБО 2 покоління можна в інтернет-магазині AutogasMarket."
				]
			},
			{
				headline : "Конструкція і принцип дії",
				content : [
					"У балоні, що традиційно встановлюється в кормовій частині автомобіля, пропан-бутан міститься в рідкій фазі під тиском до 16 атмосфер. Через мультиклапан газ під тиском подається в паливну (газову) магістраль, яка і підводить його в підкапотний простір. Тут на вході пропан-бутан спочатку потрапляє в електроклапан з вбудованим паливним фільтром, який уловлює і відокремлює з газу смоляні і тверді речовини."
				],
				img : require("../Images/second_generation_page.jpg"),
			},
			{
				content : [
					"При активації режиму їзди на газі, електроклапан відкривається, і рідкий пропан-бутан надходить у двоступеневий вакуумний або електронний редуктор-регулятор. Тут він переводиться з рідкої фази в парову, за рахунок підігріву редуктора від системи охолодження, а тиск газу знижується в першій камері до 2 атм. і далі в другій до 0,5 атм. Після цього під впливом розрідження утвореного всередині впускного колектора працюючого мотора, газ з другого ступеня редуктора всмоктується через змішувач і надходить у карбюратор або колектор (інжекторний варіант), після чого подається в циліндри."
				],
			},
			{
				headline : "Вартість переходу на ГБО 2 покоління",
				content : [
					"Завдяки компанії Profigas переобладнання вашого автомобіля буде економічно вигідним. Ми пропонуємо лояльні ціни не обладнання і його монтаж, а також сервісне і гарантійне обслуговування. Доступні наступні варіанти компоновки ГБО другого покоління:",
					"Система живлення «Карбюратор» включає клапан бензину, редуктор, перемикач газ / бензин, змішувач і дозатор газу. Відповідно моделі автомобіля підбирається балон з мультиклапаном. Ціна – від 8000 грн.",
					"Система живлення «Інжектор» – крім стандартного набору, в систему додається емулятор бензинових форсунок. Ціна для моноінжектора – від 8500 грн., Інжектора – від 9000 грн."
				]
			},
        ]
    },
    {
        title : "Установка ГБО 4-го покоління",
        path : "fouth_generation",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
			{
				headline : "Переваги використання газобалонної системи 2-го покоління:",
				content : [
					"Простота і надійність конструкції, мінімальну присутність електроніки, висока ремонтопридатність в звичайних умовах, доступна непрофесіоналові настройка і діагностика, недороге обладнання і вартість його монтажу.",
					"Залежно від двигуна вашого автомобіля використовуються і різні покоління газобалонного обладнання. Класичне і досить поширене ГБО 2 покоління використовують для установки на карбюраторні двигуни, мотори з одною бензиновою форсункою чи інжекторним впорскуванням палива. Враховуючи ймовірність виникнення зворотних хлопків важливою технічною умовою установки ГБО 2 покоління є металевий впускний колектор. У автомобілів після 2001 року колектор може бути виконаний з пластика, а значить він потребує ГБО 4 покоління."
				],
			},
			{
				headline : "Переваги ГБО 2 покоління",
				content : [
					"Це найпростіша система впорскування газового палива. Вона невибаглива до установки, експлуатації і ремонту. Її монтаж не вимагає висококваліфікованого обслуговування; це переважно механічний пристрій, з мінімумом електронних вузлів і відсутністю складної програмної складової. Придбати ГБО 2 покоління можна в інтернет-магазині AutogasMarket."
				]
			},
			{
				headline : "Конструкція і принцип дії",
				content : [
					"У балоні, що традиційно встановлюється в кормовій частині автомобіля, пропан-бутан міститься в рідкій фазі під тиском до 16 атмосфер. Через мультиклапан газ під тиском подається в паливну (газову) магістраль, яка і підводить його в підкапотний простір. Тут на вході пропан-бутан спочатку потрапляє в електроклапан з вбудованим паливним фільтром, який уловлює і відокремлює з газу смоляні і тверді речовини."
				],
				img : require("../Images/second_generation_page.jpg"),
			},
			{
				content : [
					"При активації режиму їзди на газі, електроклапан відкривається, і рідкий пропан-бутан надходить у двоступеневий вакуумний або електронний редуктор-регулятор. Тут він переводиться з рідкої фази в парову, за рахунок підігріву редуктора від системи охолодження, а тиск газу знижується в першій камері до 2 атм. і далі в другій до 0,5 атм. Після цього під впливом розрідження утвореного всередині впускного колектора працюючого мотора, газ з другого ступеня редуктора всмоктується через змішувач і надходить у карбюратор або колектор (інжекторний варіант), після чого подається в циліндри."
				],
			},
			{
				headline : "Вартість переходу на ГБО 2 покоління",
				content : [
					"Завдяки компанії Profigas переобладнання вашого автомобіля буде економічно вигідним. Ми пропонуємо лояльні ціни не обладнання і його монтаж, а також сервісне і гарантійне обслуговування. Доступні наступні варіанти компоновки ГБО другого покоління:",
					"Система живлення «Карбюратор» включає клапан бензину, редуктор, перемикач газ / бензин, змішувач і дозатор газу. Відповідно моделі автомобіля підбирається балон з мультиклапаном. Ціна – від 8000 грн.",
					"Система живлення «Інжектор» – крім стандартного набору, в систему додається емулятор бензинових форсунок. Ціна для моноінжектора – від 8500 грн., Інжектора – від 9000 грн."
				]
			},
        ]
    },
    {
        title :  "Установка ГБО на FSI, TSI, GDI",
        path : "fsi_tsi_gdi",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
			{
				headline : "Переваги використання газобалонної системи 2-го покоління:",
				content : [
					"Простота і надійність конструкції, мінімальну присутність електроніки, висока ремонтопридатність в звичайних умовах, доступна непрофесіоналові настройка і діагностика, недороге обладнання і вартість його монтажу.",
					"Залежно від двигуна вашого автомобіля використовуються і різні покоління газобалонного обладнання. Класичне і досить поширене ГБО 2 покоління використовують для установки на карбюраторні двигуни, мотори з одною бензиновою форсункою чи інжекторним впорскуванням палива. Враховуючи ймовірність виникнення зворотних хлопків важливою технічною умовою установки ГБО 2 покоління є металевий впускний колектор. У автомобілів після 2001 року колектор може бути виконаний з пластика, а значить він потребує ГБО 4 покоління."
				],
			},
			{
				headline : "Переваги ГБО 2 покоління",
				content : [
					"Це найпростіша система впорскування газового палива. Вона невибаглива до установки, експлуатації і ремонту. Її монтаж не вимагає висококваліфікованого обслуговування; це переважно механічний пристрій, з мінімумом електронних вузлів і відсутністю складної програмної складової. Придбати ГБО 2 покоління можна в інтернет-магазині AutogasMarket."
				]
			},
			{
				headline : "Конструкція і принцип дії",
				content : [
					"У балоні, що традиційно встановлюється в кормовій частині автомобіля, пропан-бутан міститься в рідкій фазі під тиском до 16 атмосфер. Через мультиклапан газ під тиском подається в паливну (газову) магістраль, яка і підводить його в підкапотний простір. Тут на вході пропан-бутан спочатку потрапляє в електроклапан з вбудованим паливним фільтром, який уловлює і відокремлює з газу смоляні і тверді речовини."
				],
				img : require("../Images/second_generation_page.jpg"),
			},
			{
				content : [
					"При активації режиму їзди на газі, електроклапан відкривається, і рідкий пропан-бутан надходить у двоступеневий вакуумний або електронний редуктор-регулятор. Тут він переводиться з рідкої фази в парову, за рахунок підігріву редуктора від системи охолодження, а тиск газу знижується в першій камері до 2 атм. і далі в другій до 0,5 атм. Після цього під впливом розрідження утвореного всередині впускного колектора працюючого мотора, газ з другого ступеня редуктора всмоктується через змішувач і надходить у карбюратор або колектор (інжекторний варіант), після чого подається в циліндри."
				],
			},
			{
				headline : "Вартість переходу на ГБО 2 покоління",
				content : [
					"Завдяки компанії Profigas переобладнання вашого автомобіля буде економічно вигідним. Ми пропонуємо лояльні ціни не обладнання і його монтаж, а також сервісне і гарантійне обслуговування. Доступні наступні варіанти компоновки ГБО другого покоління:",
					"Система живлення «Карбюратор» включає клапан бензину, редуктор, перемикач газ / бензин, змішувач і дозатор газу. Відповідно моделі автомобіля підбирається балон з мультиклапаном. Ціна – від 8000 грн.",
					"Система живлення «Інжектор» – крім стандартного набору, в систему додається емулятор бензинових форсунок. Ціна для моноінжектора – від 8500 грн., Інжектора – від 9000 грн."
				]
			},
        ]
    },
    {
        title : "Установка ГБО на електромобілі",
        path : "electric_car",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
			{
				headline : "Переваги використання газобалонної системи 2-го покоління:",
				content : [
					"Простота і надійність конструкції, мінімальну присутність електроніки, висока ремонтопридатність в звичайних умовах, доступна непрофесіоналові настройка і діагностика, недороге обладнання і вартість його монтажу.",
					"Залежно від двигуна вашого автомобіля використовуються і різні покоління газобалонного обладнання. Класичне і досить поширене ГБО 2 покоління використовують для установки на карбюраторні двигуни, мотори з одною бензиновою форсункою чи інжекторним впорскуванням палива. Враховуючи ймовірність виникнення зворотних хлопків важливою технічною умовою установки ГБО 2 покоління є металевий впускний колектор. У автомобілів після 2001 року колектор може бути виконаний з пластика, а значить він потребує ГБО 4 покоління."
				],
			},
			{
				headline : "Переваги ГБО 2 покоління",
				content : [
					"Це найпростіша система впорскування газового палива. Вона невибаглива до установки, експлуатації і ремонту. Її монтаж не вимагає висококваліфікованого обслуговування; це переважно механічний пристрій, з мінімумом електронних вузлів і відсутністю складної програмної складової. Придбати ГБО 2 покоління можна в інтернет-магазині AutogasMarket."
				]
			},
			{
				headline : "Конструкція і принцип дії",
				content : [
					"У балоні, що традиційно встановлюється в кормовій частині автомобіля, пропан-бутан міститься в рідкій фазі під тиском до 16 атмосфер. Через мультиклапан газ під тиском подається в паливну (газову) магістраль, яка і підводить його в підкапотний простір. Тут на вході пропан-бутан спочатку потрапляє в електроклапан з вбудованим паливним фільтром, який уловлює і відокремлює з газу смоляні і тверді речовини."
				],
				img : require("../Images/second_generation_page.jpg"),
			},
			{
				content : [
					"При активації режиму їзди на газі, електроклапан відкривається, і рідкий пропан-бутан надходить у двоступеневий вакуумний або електронний редуктор-регулятор. Тут він переводиться з рідкої фази в парову, за рахунок підігріву редуктора від системи охолодження, а тиск газу знижується в першій камері до 2 атм. і далі в другій до 0,5 атм. Після цього під впливом розрідження утвореного всередині впускного колектора працюючого мотора, газ з другого ступеня редуктора всмоктується через змішувач і надходить у карбюратор або колектор (інжекторний варіант), після чого подається в циліндри."
				],
			},
			{
				headline : "Вартість переходу на ГБО 2 покоління",
				content : [
					"Завдяки компанії Profigas переобладнання вашого автомобіля буде економічно вигідним. Ми пропонуємо лояльні ціни не обладнання і його монтаж, а також сервісне і гарантійне обслуговування. Доступні наступні варіанти компоновки ГБО другого покоління:",
					"Система живлення «Карбюратор» включає клапан бензину, редуктор, перемикач газ / бензин, змішувач і дозатор газу. Відповідно моделі автомобіля підбирається балон з мультиклапаном. Ціна – від 8000 грн.",
					"Система живлення «Інжектор» – крім стандартного набору, в систему додається емулятор бензинових форсунок. Ціна для моноінжектора – від 8500 грн., Інжектора – від 9000 грн."
				]
			},
        ]
    },
    {
        title : "Установка ГБО на дизель",
        path : "diesel",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
			{
				headline : "Переваги використання газобалонної системи 2-го покоління:",
				content : [
					"Простота і надійність конструкції, мінімальну присутність електроніки, висока ремонтопридатність в звичайних умовах, доступна непрофесіоналові настройка і діагностика, недороге обладнання і вартість його монтажу.",
					"Залежно від двигуна вашого автомобіля використовуються і різні покоління газобалонного обладнання. Класичне і досить поширене ГБО 2 покоління використовують для установки на карбюраторні двигуни, мотори з одною бензиновою форсункою чи інжекторним впорскуванням палива. Враховуючи ймовірність виникнення зворотних хлопків важливою технічною умовою установки ГБО 2 покоління є металевий впускний колектор. У автомобілів після 2001 року колектор може бути виконаний з пластика, а значить він потребує ГБО 4 покоління."
				],
			},
			{
				headline : "Переваги ГБО 2 покоління",
				content : [
					"Це найпростіша система впорскування газового палива. Вона невибаглива до установки, експлуатації і ремонту. Її монтаж не вимагає висококваліфікованого обслуговування; це переважно механічний пристрій, з мінімумом електронних вузлів і відсутністю складної програмної складової. Придбати ГБО 2 покоління можна в інтернет-магазині AutogasMarket."
				]
			},
			{
				headline : "Конструкція і принцип дії",
				content : [
					"У балоні, що традиційно встановлюється в кормовій частині автомобіля, пропан-бутан міститься в рідкій фазі під тиском до 16 атмосфер. Через мультиклапан газ під тиском подається в паливну (газову) магістраль, яка і підводить його в підкапотний простір. Тут на вході пропан-бутан спочатку потрапляє в електроклапан з вбудованим паливним фільтром, який уловлює і відокремлює з газу смоляні і тверді речовини."
				],
				img : require("../Images/second_generation_page.jpg"),
			},
			{
				content : [
					"При активації режиму їзди на газі, електроклапан відкривається, і рідкий пропан-бутан надходить у двоступеневий вакуумний або електронний редуктор-регулятор. Тут він переводиться з рідкої фази в парову, за рахунок підігріву редуктора від системи охолодження, а тиск газу знижується в першій камері до 2 атм. і далі в другій до 0,5 атм. Після цього під впливом розрідження утвореного всередині впускного колектора працюючого мотора, газ з другого ступеня редуктора всмоктується через змішувач і надходить у карбюратор або колектор (інжекторний варіант), після чого подається в циліндри."
				],
			},
			{
				headline : "Вартість переходу на ГБО 2 покоління",
				content : [
					"Завдяки компанії Profigas переобладнання вашого автомобіля буде економічно вигідним. Ми пропонуємо лояльні ціни не обладнання і його монтаж, а також сервісне і гарантійне обслуговування. Доступні наступні варіанти компоновки ГБО другого покоління:",
					"Система живлення «Карбюратор» включає клапан бензину, редуктор, перемикач газ / бензин, змішувач і дозатор газу. Відповідно моделі автомобіля підбирається балон з мультиклапаном. Ціна – від 8000 грн.",
					"Система живлення «Інжектор» – крім стандартного набору, в систему додається емулятор бензинових форсунок. Ціна для моноінжектора – від 8500 грн., Інжектора – від 9000 грн."
				]
			},
        ]
    }    
]

const SpecificService = () => {

	const params = useParams()
 	const path = params.path

 	const include = services.filter(item => item.path === path)

 	if (include.length) {
 		return (
			services.map(item => {
	    		if (path === item.path) {

	    			return(
	    				<div className="homeCont"> 
	    					<ArrowUp/>
							<BelowHeaderImage
                				headline = {item.title}
            				/>
            				<div className="flexCenteredBlock">
                				<h1 className="headerFontSize">Послуги для ГБО в єдиному автосервісі</h1>
                				<RequestButton/>
            				</div>
            				<div className="separator"></div>
            				<div className="flexCont">
	        					{item.subCategory.map(item => {
        							return(
        								<div className="flexElementCont">
	        								<span className="textHeadline">
	        									<b>{item.headline}</b>
	        								</span>
	        								<div className="container">
												{item.content.map(content => (
													<span className="textContent">
														{content}
													</span>
												))}
												{!!item.img &&
													(
														<img src={item.img} className="imageCont"/>
													)
												}
											</div>		
										</div>	
        							)		
	        					})}
        					</div>
						</div>
					)
	    		} 
	    	})
		)
 	} else {
 		return (
 			<NotFoundPage/>
 		)
 	}
    	
}
export {SpecificService}