import "./Content.scss"
import "./SpecificService.scss"
import {useParams} from "react-router";
import {NotFoundPage} from "./NotFoundPage"
import {BelowHeaderImage} from "./BelowHeaderImage"
import {RequestButton} from "./RequestButton";
import {ArrowUp} from "./ArrowUp";

export const services = [
    {
        title : "Установка ГБО 2-го покоління",
        path : "second_generation",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
			{
				headline : "Переваги використання газобалонної системи 2-го покоління",
				content : [
					"Простота і надійність конструкції, мінімальну присутність електроніки, висока ремонтопридатність в звичайних умовах, доступна непрофесіоналові настройка і діагностика, недороге обладнання і вартість його монтажу.",
					"Залежно від двигуна вашого автомобіля використовуються і різні покоління газобалонного обладнання. Класичне і досить поширене ГБО 2 покоління використовують для установки на карбюраторні двигуни, мотори з одною бензиновою форсункою чи інжекторним впорскуванням палива. Враховуючи ймовірність виникнення зворотних хлопків важливою технічною умовою установки ГБО 2 покоління є металевий впускний колектор. У автомобілів після 2001 року колектор може бути виконаний з пластика, а значить він потребує ГБО 4 покоління."
				],
			},
			{
				headline : "Переваги ГБО 2 покоління",
				content : [
					"Це найпростіша система впорскування газового палива. Вона невибаглива до установки, експлуатації і ремонту. Її монтаж не вимагає висококваліфікованого обслуговування; це переважно механічний пристрій, з мінімумом електронних вузлів і відсутністю складної програмної складової. Придбати ГБО 2 покоління можна в інтернет-магазині AutogasMarket."
				]
			},
			{
				headline : "Конструкція і принцип дії",
				content : [
					"У балоні, що традиційно встановлюється в кормовій частині автомобіля, пропан-бутан міститься в рідкій фазі під тиском до 16 атмосфер. Через мультиклапан газ під тиском подається в паливну (газову) магістраль, яка і підводить його в підкапотний простір. Тут на вході пропан-бутан спочатку потрапляє в електроклапан з вбудованим паливним фільтром, який уловлює і відокремлює з газу смоляні і тверді речовини."
				],
				img : require("../Images/second_generation_page.jpg"),
			},
			{
				content : [
					"При активації режиму їзди на газі, електроклапан відкривається, і рідкий пропан-бутан надходить у двоступеневий вакуумний або електронний редуктор-регулятор. Тут він переводиться з рідкої фази в парову, за рахунок підігріву редуктора від системи охолодження, а тиск газу знижується в першій камері до 2 атм. і далі в другій до 0,5 атм. Після цього під впливом розрідження утвореного всередині впускного колектора працюючого мотора, газ з другого ступеня редуктора всмоктується через змішувач і надходить у карбюратор або колектор (інжекторний варіант), після чого подається в циліндри."
				],
			},
			{
				headline : "Вартість переходу на ГБО 2 покоління",
				content : [
					"Завдяки компанії Profigas переобладнання вашого автомобіля буде економічно вигідним. Ми пропонуємо лояльні ціни не обладнання і його монтаж, а також сервісне і гарантійне обслуговування. Доступні наступні варіанти компоновки ГБО другого покоління:",
					"Система живлення «Карбюратор» включає клапан бензину, редуктор, перемикач газ / бензин, змішувач і дозатор газу. Відповідно моделі автомобіля підбирається балон з мультиклапаном. Ціна – від 8000 грн.",
					"Система живлення «Інжектор» – крім стандартного набору, в систему додається емулятор бензинових форсунок. Ціна для моноінжектора – від 8500 грн., Інжектора – від 9000 грн."
				]
			},
        ]
    },
    {
        title : "Установка ГБО 4-го покоління",
        path : "fourth_generation",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
			{
				headline : "Що привнесли газобалонні системи 4-покоління",
				content : [
					"Порівняно недавно газове обладнання 4 покоління набуло поширення. Воно набагато ефективніше, ніж попередні системи, так як дозволяє здійснювати управління роботою двигуна, орієнтуючись на показання датчиків. Варто зауважити, що використовується таке обладнання на автомобілях з інжекторною системою уприскування. ",
					"По-перше, виникає необхідність у калібрування, яка проводиться за даними, отриманими зі штатних бензинових форсунок.",
					"По-друге, в роботі бере участь безліч датчиків – витрати повітря, положення дросельної заслінки, детонації, швидкості та інші."
				],
			},
			{
				headline : "Переваги ГБО 4 покоління",
				content : [
					"Слід виділити відмітні особливості ГБО 4-го покоління, які характеризують позитивні якості, в порівнянні з попередніми системами:",
					"При проведенні встановлення обладнання неможливо допустити помилки, робота проводиться досить просто за рахунок того, що всі з’єднання проводів мають виконання у вигляді різних роз’ємів, сплутати їх неможливо, тому ризик неправильного підключення виключено;",
					"Витрата палива (газу) мінімальний за рахунок використання микроконтроллерной системи управління роботою обладнання;",
					"Автомобіль, обладнаний ГБО 4-го покоління, відповідає нормам токсичності Євро-2, Євро-3 і Євро-4;"
				]
			},
			{
				headline : "Основні вузли ГБО 4 покоління",
				content : [
					"Для зберігання стисненого газу використовується балон. До нього пред’являються певні вимоги – герметичність, надійність, міцність. Для використання газового балона на автомобілі потрібен дозвіл. Видати його можуть тільки фахівці, у яких є ліцензія для здійснення даної процедури. Так як впорскування газу відбувається під тиском, меншим ніж те, яке в балоні, то необхідно його знижувати. Для цієї мети використовується редуктор. В метанових установках вони мають два ступені зниження тиску, а в пропан-бутанових достатньо однієї. Причина – у першому випадку тиск у балоні може досягати значення до 200 Атмосфер, у другому – до 16."
				],
				img : require("../Images/fourth_generation_page.jpg"),
			},
			{
				content :[
					"Газові форсунки необхідні для вприскування палива в камеру згоряння. Вони з’єднані з редуктором-випарником. Управління всією системою здійснюється за допомогою електронної начинки – ЕБУ, яка працює завдяки мікропроцесору. В нього закладається прошивка, яка забезпечує роботу згідно заздалегідь продуманим алгоритмом. Газове обладнання 4 покоління має перевагу перед більш ранніми – вибір палива відбувається автоматично, без участі водія. Для цього тільки й потрібно, що встановити перемикати газ-бензин в перше положення."
				],
			},
			{
				headline : "Як працює ЕБУ?",
				content : [
					"При роботі проводиться зчитування даних, які надходять від датчиків. Зокрема, проводиться аналіз сигналів, що йдуть від лямбда-зондів – один встановлений до катколлектора, другий – після. Один основний, а інший є коригуючих. Всі параметри, лічені з датчиків надходять на вхід мікропроцесора.",
					"Але тут виникає невелика проблема – рівень сигналу в одних зчитувальних пристроїв великий, а в інших – занадто маленький. Для узгодження датчиків і портів введення мікроконтролера використовуються узгоджувальні пристрої.",
				]
			},
        ]
    },
    {
        title :  "Установка ГБО на FSI, TSI, GDI",
        path : "fsi_tsi_gdi",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
			{
				headline : "Що ховається за цими літерами?",
				content : [
					"FSI – Fuel Stratified Injection (дослівно – пошарове упорскування палива) – атмосферні бензинові двигуни з безпосереднім упорскуванням палива, що встановлюються на автомобілі концерну VAG. Історія цих двигунів почалася в 2000 році після того, як перший серійний зразок був встановлений на Volkswagen. А на сьогоднішній день мотори із шильдиком FSI встановлюються лише на VolksWagen Touareg 4 WD.",
					"TSI (TFSI) – Turbo Stratified Injection (турбоване пошарове упорскування) – це, по суті, FSI мотор, оснащений турбіною. Тому детально розглядати його ми не будемо, зазначимо лише, що TSI від TSFI відрізняється лише тим, що перші встановлюються на автомобілі VolksWagen, а другі на Audi. Ось такий кумедний маркетинговий хід, спрямований на популяризацію автомобілів дорожчого бренду!",
					"GDI – Gasoline Direct Injection (дослівно – пряме упорскування бензину) – інжекторна система подачі палива для бензинових двигунів внутрішнього згоряння з безпосереднім упорскуванням палива. Використовується у автомобілях марки Mitsubishi."
				],
			},
			{
				headline : "Принципові відмінності та особливості систем FSI/TSI",
				content : [
					"Головна відмінність двигунів з технологіями TSI та FSI від звичайних ДВЗ – те, що подача палива здійснюється безпосередньо в камеру згоряння двигуна.",
					"Примітний і той факт, що паливна система цих автомобілів оснащена другим контуром високого тиску, який дозволяє здійснювати подачу бензину точніше, що суттєво позначається на потужності двигуна та мінімалізації витрат палива.",
					"Залежно від навантаження на двигун тиск бензину в паливній системі може коливатися в межах 0,5-0,05 МПа. А це означає, що якісь вищі сили відповідають за ухвалення рішення, під яким тиском подавати паливо зараз. І ці найвищі сили – окремий електронний блок управління."
				]
			},
			{
				headline : "Конструкція і принцип дії",
				content : [
					"У балоні, що традиційно встановлюється в кормовій частині автомобіля, пропан-бутан міститься в рідкій фазі під тиском до 16 атмосфер. Через мультиклапан газ під тиском подається в паливну (газову) магістраль, яка і підводить його в підкапотний простір. Тут на вході пропан-бутан спочатку потрапляє в електроклапан з вбудованим паливним фільтром, який уловлює і відокремлює з газу смоляні і тверді речовини."
				],
				img : require("../Images/fsi_page.jpg"),
			},
			{
				content : [
					"При безпосередньому впорскуванні бензинова форсунка, що піддається дії високої температури дуже швидко закоксовується і вигоряє якщо через неї не подається паливо. Для вирішення даної проблеми застосовується технологія довпирскування мінімальної дози бензину через форсунки при роботі двигуна на газовому паливі."
				],
			},
        ]
    },
    {
        title : "Установка ГБО на електромобілі",
        path : "electric_car",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
			{
				headline : "В Україні масово встановлюють ГБО в електромобілі",
				content : [
					"Наразі в Україні стали масово встановлювати газобалонне обладнання на підтримані електроавтомобілі. Це робиться для того, щоб покращити та збільшити запас ходу та підвищити рівень комфорту.",
				],
				img : require("../Images/electro_page.jpg")
			},
			{
				content : [
					"Так Так! Саме такою установкою ГБО автовласники іменитих електромобілів вирішують проблему невеликого запасу ходу, але вони не повністю переоснащують авто під їзду на пропан-бутані, а застосовують газ для зменшення витрати електрики.",
					"У цьому випадку газовою системою виступає не саме обладнання, а піч та підключений до неї газовий балон. За допомогою автономної пічки можна знизити або взагалі не витрачати енергію акумулятора на обігрів салону і таким чином збільшити запас ходу."
				]
			},
			{
				headline : "Відомі представники",
				content : [
					"Також серед користувачів газової печі є відомі е-мобілі, такі як Nissan Leaf та Renault Zoe – ціна подібної печі варіюється від 8 до 15 тис. грн. ",
					"Все залежить від моделі та функціоналу обігрівача. Адже, на ринку цього товару є недорогі пристрої китайського виробництва та дорожчого – це австрійського та німецького виробництва.",
					"Хоча, встановлюючи подібне обладнання на електромобіль, воно може окупитися, наприклад, при роботі \"в режимі таксі\". А якщо його встановити для себе, то подібне ГБО забезпечить комфортом і невеликою економією коштів.",
				],
			},
        ]
    },
    {
        title : "Установка ГБО на дизель",
        path : "diesel",
        img : require("../Images/man_working_under_the_hood_of_a_car.jpg"),
        subCategory : [
			{
				headline : "Переваги газодизельних систем",
				content : [
					"Економія паливних витрат до 40%;",
					"Щадний режим роботи паливної системи;",
					"Покращення згоряння дизельного палива;",
					"Постійно чистий фільтр сажі;",
					"М'яка, плавна робота двигуна;",
					"Приріст потужності до 15%;",
					"Збільшення запасу ходу до 50%.",
					"Зростання цін на дизельне паливо робить економічно виправданим оснащення автомобілів із дизельними двигунами газобалонним обладнанням. Установка ГБО разом із дизелем виправдана для вантажних машин, пасажирського транспорту та сільськогосподарської техніки. При схемі \"газ на дизель\" дизельне паливо використовується для запалювання паливо-повітряної суміші. Паралельна робота на обох видах палива дозволить заправляти солярку, якщо поблизу немає газозаправної станції.",
				],
			},
			{
				headline : "Вигоди спільного використання газового обладнання та дизеля",
				content : [
					"Окрім очевидної економічної вигоди від різниці цін, монтаж ГБО на дизель зменшує знос механізмів двигуна та викиди в атмосферу.",
					"Паливо вигоряє значно більшою мірою, що зменшує накопичення гару на деталях двигуна та вміст шкідливих речовин у вихлопі.",
					"Переробка паливної системи не вимагає радикальних змін конструкції та складних технічних хитрощів, при цьому не знижуючи, а підвищуючи ресурс механізмів та забезпечуючи цілу низку переваг.",
				]
			},
			{
				headline : "ГБО для дизельного транспорту має наступний принцип роботи",
				content : [
					"Установка на штатний паливний насос дозуючого пристрою (залишається можливість роботи також на дизельному паливі у звичайному режимі), яке набирає чинності при подачі на нього електрики;",
					"Дозуючий пристрій обмежує подачу солярки та дозволяє оптимізувати її використання при різних навантаженнях;",
					"Подача газу до впускного колектора в достатній пропорції з потраплянням безпосередньо в циліндри;",
					"На останній стадії такту стиснення в циліндри подається запальна доза дизельного палива та здійснюється запалення газово-повітряної суміші.",
					"Система налаштована таким чином, що на холостому ходу автомобіль працює тільки на дизелі, а при збільшенні обертів та підвищеному навантаженні здійснюється процес заміщення."
				],
				img : require("../Images/diesel_page.jpg"),
			},
			{
				headline : "Серед мінусів використання ГБО слід зазначити",
				content : [
					"Висока початкова вартість. Середня ціна складає близько 500 євро.",
					"Зниження потужності проти бензином.",
					"Необхідність переобладнання транспортного засобу.",
					"Високі витрати обслуговування системи. Кожні 15 тис. км. необхідно змінювати фільтр. Планові перевірки відбуваються кожні 250 тис. км пробігу.",
					"Зниження місткості багажника.",
					"Необхідність реєстрації обладнання.",
					"Проблеми з продажем авто із ГБО. Деякі покупці можуть бути противниками переобладнання та відмовляться брати машину.",
				]
			},
        ]
    }    
]

const SpecificService = () => {

	const params = useParams()
 	const path = params.path

 	const include = services.filter(item => item.path === path)

 	if (include.length) {
 		return (
			services.map(item => {
	    		if (path === item.path) {

	    			return(
	    				<div className="homeCont"> 
	    					<ArrowUp/>
							<BelowHeaderImage
                				headline = {item.title}
            				/>
            				<div className="flexCenteredBlock">
                				<h1 className="headerFontSize">Послуги для ГБО в єдиному автосервісі</h1>
                				<RequestButton/>
            				</div>
            				<div className="separator"></div>
            				<div className="flexCont">
	        					{item.subCategory.map(item => {
        							return(
        								<div className="flexElementCont">
	        								<span className="textHeadline">
	        									<b>{item.headline}</b>
	        								</span>
	        								<div className="container">
												{item.content.map(content => (
													<span className="textContent">
														{content}
													</span>
												))}
												{!!item.img &&
													(
														<div className="imgCont">
															<img src={item.img} className="image"/>
														</div>
													)
												}
											</div>		
										</div>	
        							)		
	        					})}
        					</div>
						</div>
					)
	    		} 
	    	})
		)
 	} else {
 		return (
 			<NotFoundPage/>
 		)
 	}
    	
}
export {SpecificService}